hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
/*
; stm32N657_rifsc.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_rifsc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// RIFSC address definitions
// -------------------------

typedef struct {
	volatile	uint32_t	RISC_CR;
	volatile	uint32_t	RESERVED0[3];
	volatile	uint32_t	RISC_SECCFGR0;
	volatile	uint32_t	RISC_SECCFGR1;
	volatile	uint32_t	RISC_SECCFGR2;
	volatile	uint32_t	RISC_SECCFGR3;
	volatile	uint32_t	RISC_SECCFGR4;
	volatile	uint32_t	RISC_SECCFGR5;
	volatile	uint32_t	RESERVED1[2];
	volatile	uint32_t	RISC_PRIVCFGR0;
	volatile	uint32_t	RISC_PRIVCFGR1;
	volatile	uint32_t	RISC_PRIVCFGR2;
	volatile	uint32_t	RISC_PRIVCFGR3;
	volatile	uint32_t	RISC_PRIVCFGR4;
	volatile	uint32_t	RISC_PRIVCFGR5;
	volatile	uint32_t	RESERVED2[2];
	volatile	uint32_t	RISC_RCFGLOCKR0;
	volatile	uint32_t	RISC_RCFGLOCKR1;
	volatile	uint32_t	RISC_RCFGLOCKR2;
	volatile	uint32_t	RISC_RCFGLOCKR3;
	volatile	uint32_t	RISC_RCFGLOCKR4;
	volatile	uint32_t	RISC_RCFGLOCKR5;
	volatile	uint32_t	RESERVED3[742];
	volatile	uint32_t	RIMC_CR;
	volatile	uint32_t	RESERVED4[3];
	volatile	uint32_t	RIMC_ATTR0;
	volatile	uint32_t	RIMC_ATTR1;
	volatile	uint32_t	RIMC_ATTR2;
	volatile	uint32_t	RIMC_ATTR3;
	volatile	uint32_t	RIMC_ATTR4;
	volatile	uint32_t	RIMC_ATTR5;
	volatile	uint32_t	RIMC_ATTR6;
	volatile	uint32_t	RIMC_ATTR7;
	volatile	uint32_t	RIMC_ATTR8;
	volatile	uint32_t	RIMC_ATTR9;
	volatile	uint32_t	RIMC_ATTR10;
	volatile	uint32_t	RIMC_ATTR11;
	volatile	uint32_t	RESERVED5[220];
	volatile	uint32_t	PPSR0;
	volatile	uint32_t	PPSR1;
	volatile	uint32_t	PPSR2;
	volatile	uint32_t	PPSR3;
	volatile	uint32_t	PPSR4;
	volatile	uint32_t	PPSR5;
} RIFSC_TypeDef;

#if (defined(__cplusplus))
#define	RIFSC_NS	reinterpret_cast<RIFSC_TypeDef *>(0x44024000u)
#define	RIFSC_S		reinterpret_cast<RIFSC_TypeDef *>(0x54024000u)

#else
#define	RIFSC_NS	((RIFSC_TypeDef *)0x44024000u)
#define	RIFSC_S		((RIFSC_TypeDef *)0x54024000u)
#endif

// RISC_CR Configuration

#define	RIFSC_RISC_CR_GLOCK						(0x1u<<0)

#define	RIFSC_RISC_CR_GLOCK_B_0X0				(0x0u<<0)
#define	RIFSC_RISC_CR_GLOCK_B_0X1				(0x1u<<0)

// RISC_SECCFGR0 Configuration

#define	RIFSC_RISC_SECCFGR0_SEC31				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR0_SEC30				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR0_SEC29				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR0_SEC28				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR0_SEC27				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR0_SEC26				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR0_SEC25				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR0_SEC24				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR0_SEC23				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR0_SEC22				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR0_SEC21				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR0_SEC20				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR0_SEC19				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR0_SEC18				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR0_SEC17				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR0_SEC16				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR0_SEC15				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR0_SEC14				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR0_SEC13				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR0_SEC12				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR0_SEC11				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR0_SEC10				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR0_SEC9				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR0_SEC8				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR0_SEC7				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR0_SEC6				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR0_SEC5				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR0_SEC4				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR0_SEC3				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR0_SEC2				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR0_SEC1				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR0_SEC0				(0x1u<<0)

#define	RIFSC_RISC_SECCFGR0_SEC31_B_0X0			(0x0u<<31)
#define	RIFSC_RISC_SECCFGR0_SEC31_B_0X1			(0x1u<<31)
#define	RIFSC_RISC_SECCFGR0_SEC30_B_0X0			(0x0u<<30)
#define	RIFSC_RISC_SECCFGR0_SEC30_B_0X1			(0x1u<<30)
#define	RIFSC_RISC_SECCFGR0_SEC29_B_0X0			(0x0u<<29)
#define	RIFSC_RISC_SECCFGR0_SEC29_B_0X1			(0x1u<<29)
#define	RIFSC_RISC_SECCFGR0_SEC28_B_0X0			(0x0u<<28)
#define	RIFSC_RISC_SECCFGR0_SEC28_B_0X1			(0x1u<<28)
#define	RIFSC_RISC_SECCFGR0_SEC27_B_0X0			(0x0u<<27)
#define	RIFSC_RISC_SECCFGR0_SEC27_B_0X1			(0x1u<<27)
#define	RIFSC_RISC_SECCFGR0_SEC26_B_0X0			(0x0u<<26)
#define	RIFSC_RISC_SECCFGR0_SEC26_B_0X1			(0x1u<<26)
#define	RIFSC_RISC_SECCFGR0_SEC25_B_0X0			(0x0u<<25)
#define	RIFSC_RISC_SECCFGR0_SEC25_B_0X1			(0x1u<<25)
#define	RIFSC_RISC_SECCFGR0_SEC24_B_0X0			(0x0u<<24)
#define	RIFSC_RISC_SECCFGR0_SEC24_B_0X1			(0x1u<<24)
#define	RIFSC_RISC_SECCFGR0_SEC23_B_0X0			(0x0u<<23)
#define	RIFSC_RISC_SECCFGR0_SEC23_B_0X1			(0x1u<<23)
#define	RIFSC_RISC_SECCFGR0_SEC22_B_0X0			(0x0u<<22)
#define	RIFSC_RISC_SECCFGR0_SEC22_B_0X1			(0x1u<<22)
#define	RIFSC_RISC_SECCFGR0_SEC21_B_0X0			(0x0u<<21)
#define	RIFSC_RISC_SECCFGR0_SEC21_B_0X1			(0x1u<<21)
#define	RIFSC_RISC_SECCFGR0_SEC20_B_0X0			(0x0u<<20)
#define	RIFSC_RISC_SECCFGR0_SEC20_B_0X1			(0x1u<<20)
#define	RIFSC_RISC_SECCFGR0_SEC19_B_0X0			(0x0u<<19)
#define	RIFSC_RISC_SECCFGR0_SEC19_B_0X1			(0x1u<<19)
#define	RIFSC_RISC_SECCFGR0_SEC18_B_0X0			(0x0u<<18)
#define	RIFSC_RISC_SECCFGR0_SEC18_B_0X1			(0x1u<<18)
#define	RIFSC_RISC_SECCFGR0_SEC17_B_0X0			(0x0u<<17)
#define	RIFSC_RISC_SECCFGR0_SEC17_B_0X1			(0x1u<<17)
#define	RIFSC_RISC_SECCFGR0_SEC16_B_0X0			(0x0u<<16)
#define	RIFSC_RISC_SECCFGR0_SEC16_B_0X1			(0x1u<<16)
#define	RIFSC_RISC_SECCFGR0_SEC15_B_0X0			(0x0u<<15)
#define	RIFSC_RISC_SECCFGR0_SEC15_B_0X1			(0x1u<<15)
#define	RIFSC_RISC_SECCFGR0_SEC14_B_0X0			(0x0u<<14)
#define	RIFSC_RISC_SECCFGR0_SEC14_B_0X1			(0x1u<<14)
#define	RIFSC_RISC_SECCFGR0_SEC13_B_0X0			(0x0u<<13)
#define	RIFSC_RISC_SECCFGR0_SEC13_B_0X1			(0x1u<<13)
#define	RIFSC_RISC_SECCFGR0_SEC12_B_0X0			(0x0u<<12)
#define	RIFSC_RISC_SECCFGR0_SEC12_B_0X1			(0x1u<<12)
#define	RIFSC_RISC_SECCFGR0_SEC11_B_0X0			(0x0u<<11)
#define	RIFSC_RISC_SECCFGR0_SEC11_B_0X1			(0x1u<<11)
#define	RIFSC_RISC_SECCFGR0_SEC10_B_0X0			(0x0u<<10)
#define	RIFSC_RISC_SECCFGR0_SEC10_B_0X1			(0x1u<<10)
#define	RIFSC_RISC_SECCFGR0_SEC9_B_0X0			(0x0u<<9)
#define	RIFSC_RISC_SECCFGR0_SEC9_B_0X1			(0x1u<<9)
#define	RIFSC_RISC_SECCFGR0_SEC8_B_0X0			(0x0u<<8)
#define	RIFSC_RISC_SECCFGR0_SEC8_B_0X1			(0x1u<<8)
#define	RIFSC_RISC_SECCFGR0_SEC7_B_0X0			(0x0u<<7)
#define	RIFSC_RISC_SECCFGR0_SEC7_B_0X1			(0x1u<<7)
#define	RIFSC_RISC_SECCFGR0_SEC6_B_0X0			(0x0u<<6)
#define	RIFSC_RISC_SECCFGR0_SEC6_B_0X1			(0x1u<<6)
#define	RIFSC_RISC_SECCFGR0_SEC5_B_0X0			(0x0u<<5)
#define	RIFSC_RISC_SECCFGR0_SEC5_B_0X1			(0x1u<<5)
#define	RIFSC_RISC_SECCFGR0_SEC4_B_0X0			(0x0u<<4)
#define	RIFSC_RISC_SECCFGR0_SEC4_B_0X1			(0x1u<<4)
#define	RIFSC_RISC_SECCFGR0_SEC3_B_0X0			(0x0u<<3)
#define	RIFSC_RISC_SECCFGR0_SEC3_B_0X1			(0x1u<<3)
#define	RIFSC_RISC_SECCFGR0_SEC2_B_0X0			(0x0u<<2)
#define	RIFSC_RISC_SECCFGR0_SEC2_B_0X1			(0x1u<<2)
#define	RIFSC_RISC_SECCFGR0_SEC1_B_0X0			(0x0u<<1)
#define	RIFSC_RISC_SECCFGR0_SEC1_B_0X1			(0x1u<<1)
#define	RIFSC_RISC_SECCFGR0_SEC0_B_0X0			(0x0u<<0)
#define	RIFSC_RISC_SECCFGR0_SEC0_B_0X1			(0x1u<<0)

