hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
// RISC_SECCFGR1 Configuration

#define	RIFSC_RISC_SECCFGR1_SEC63				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR1_SEC62				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR1_SEC61				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR1_SEC60				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR1_SEC59				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR1_SEC58				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR1_SEC57				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR1_SEC56				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR1_SEC55				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR1_SEC54				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR1_SEC53				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR1_SEC52				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR1_SEC51				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR1_SEC50				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR1_SEC49				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR1_SEC48				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR1_SEC47				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR1_SEC46				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR1_SEC45				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR1_SEC44				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR1_SEC43				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR1_SEC42				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR1_SEC41				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR1_SEC40				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR1_SEC39				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR1_SEC38				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR1_SEC37				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR1_SEC36				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR1_SEC35				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR1_SEC34				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR1_SEC33				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR1_SEC32				(0x1u<<0)

#define	RIFSC_RISC_SECCFGR1_SEC63_B_0X0			(0x0u<<31)
#define	RIFSC_RISC_SECCFGR1_SEC63_B_0X1			(0x1u<<31)
#define	RIFSC_RISC_SECCFGR1_SEC62_B_0X0			(0x0u<<30)
#define	RIFSC_RISC_SECCFGR1_SEC62_B_0X1			(0x1u<<30)
#define	RIFSC_RISC_SECCFGR1_SEC61_B_0X0			(0x0u<<29)
#define	RIFSC_RISC_SECCFGR1_SEC61_B_0X1			(0x1u<<29)
#define	RIFSC_RISC_SECCFGR1_SEC60_B_0X0			(0x0u<<28)
#define	RIFSC_RISC_SECCFGR1_SEC60_B_0X1			(0x1u<<28)
#define	RIFSC_RISC_SECCFGR1_SEC59_B_0X0			(0x0u<<27)
#define	RIFSC_RISC_SECCFGR1_SEC59_B_0X1			(0x1u<<27)
#define	RIFSC_RISC_SECCFGR1_SEC58_B_0X0			(0x0u<<26)
#define	RIFSC_RISC_SECCFGR1_SEC58_B_0X1			(0x1u<<26)
#define	RIFSC_RISC_SECCFGR1_SEC57_B_0X0			(0x0u<<25)
#define	RIFSC_RISC_SECCFGR1_SEC57_B_0X1			(0x1u<<25)
#define	RIFSC_RISC_SECCFGR1_SEC56_B_0X0			(0x0u<<24)
#define	RIFSC_RISC_SECCFGR1_SEC56_B_0X1			(0x1u<<24)
#define	RIFSC_RISC_SECCFGR1_SEC55_B_0X0			(0x0u<<23)
#define	RIFSC_RISC_SECCFGR1_SEC55_B_0X1			(0x1u<<23)
#define	RIFSC_RISC_SECCFGR1_SEC54_B_0X0			(0x0u<<22)
#define	RIFSC_RISC_SECCFGR1_SEC54_B_0X1			(0x1u<<22)
#define	RIFSC_RISC_SECCFGR1_SEC53_B_0X0			(0x0u<<21)
#define	RIFSC_RISC_SECCFGR1_SEC53_B_0X1			(0x1u<<21)
#define	RIFSC_RISC_SECCFGR1_SEC52_B_0X0			(0x0u<<20)
#define	RIFSC_RISC_SECCFGR1_SEC52_B_0X1			(0x1u<<20)
#define	RIFSC_RISC_SECCFGR1_SEC51_B_0X0			(0x0u<<19)
#define	RIFSC_RISC_SECCFGR1_SEC51_B_0X1			(0x1u<<19)
#define	RIFSC_RISC_SECCFGR1_SEC50_B_0X0			(0x0u<<18)
#define	RIFSC_RISC_SECCFGR1_SEC50_B_0X1			(0x1u<<18)
#define	RIFSC_RISC_SECCFGR1_SEC49_B_0X0			(0x0u<<17)
#define	RIFSC_RISC_SECCFGR1_SEC49_B_0X1			(0x1u<<17)
#define	RIFSC_RISC_SECCFGR1_SEC48_B_0X0			(0x0u<<16)
#define	RIFSC_RISC_SECCFGR1_SEC48_B_0X1			(0x1u<<16)
#define	RIFSC_RISC_SECCFGR1_SEC47_B_0X0			(0x0u<<15)
#define	RIFSC_RISC_SECCFGR1_SEC47_B_0X1			(0x1u<<15)
#define	RIFSC_RISC_SECCFGR1_SEC46_B_0X0			(0x0u<<14)
#define	RIFSC_RISC_SECCFGR1_SEC46_B_0X1			(0x1u<<14)
#define	RIFSC_RISC_SECCFGR1_SEC45_B_0X0			(0x0u<<13)
#define	RIFSC_RISC_SECCFGR1_SEC45_B_0X1			(0x1u<<13)
#define	RIFSC_RISC_SECCFGR1_SEC44_B_0X0			(0x0u<<12)
#define	RIFSC_RISC_SECCFGR1_SEC44_B_0X1			(0x1u<<12)
#define	RIFSC_RISC_SECCFGR1_SEC43_B_0X0			(0x0u<<11)
#define	RIFSC_RISC_SECCFGR1_SEC43_B_0X1			(0x1u<<11)
#define	RIFSC_RISC_SECCFGR1_SEC42_B_0X0			(0x0u<<10)
#define	RIFSC_RISC_SECCFGR1_SEC42_B_0X1			(0x1u<<10)
#define	RIFSC_RISC_SECCFGR1_SEC41_B_0X0			(0x0u<<9)
#define	RIFSC_RISC_SECCFGR1_SEC41_B_0X1			(0x1u<<9)
#define	RIFSC_RISC_SECCFGR1_SEC40_B_0X0			(0x0u<<8)
#define	RIFSC_RISC_SECCFGR1_SEC40_B_0X1			(0x1u<<8)
#define	RIFSC_RISC_SECCFGR1_SEC39_B_0X0			(0x0u<<7)
#define	RIFSC_RISC_SECCFGR1_SEC39_B_0X1			(0x1u<<7)
#define	RIFSC_RISC_SECCFGR1_SEC38_B_0X0			(0x0u<<6)
#define	RIFSC_RISC_SECCFGR1_SEC38_B_0X1			(0x1u<<6)
#define	RIFSC_RISC_SECCFGR1_SEC37_B_0X0			(0x0u<<5)
#define	RIFSC_RISC_SECCFGR1_SEC37_B_0X1			(0x1u<<5)
#define	RIFSC_RISC_SECCFGR1_SEC36_B_0X0			(0x0u<<4)
#define	RIFSC_RISC_SECCFGR1_SEC36_B_0X1			(0x1u<<4)
#define	RIFSC_RISC_SECCFGR1_SEC35_B_0X0			(0x0u<<3)
#define	RIFSC_RISC_SECCFGR1_SEC35_B_0X1			(0x1u<<3)
#define	RIFSC_RISC_SECCFGR1_SEC34_B_0X0			(0x0u<<2)
#define	RIFSC_RISC_SECCFGR1_SEC34_B_0X1			(0x1u<<2)
#define	RIFSC_RISC_SECCFGR1_SEC33_B_0X0			(0x0u<<1)
#define	RIFSC_RISC_SECCFGR1_SEC33_B_0X1			(0x1u<<1)
#define	RIFSC_RISC_SECCFGR1_SEC32_B_0X0			(0x0u<<0)
#define	RIFSC_RISC_SECCFGR1_SEC32_B_0X1			(0x1u<<0)

// RISC_SECCFGR2 Configuration

#define	RIFSC_RISC_SECCFGR2_SEC95				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR2_SEC94				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR2_SEC93				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR2_SEC92				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR2_SEC91				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR2_SEC90				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR2_SEC89				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR2_SEC88				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR2_SEC87				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR2_SEC86				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR2_SEC85				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR2_SEC84				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR2_SEC83				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR2_SEC82				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR2_SEC81				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR2_SEC80				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR2_SEC79				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR2_SEC78				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR2_SEC77				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR2_SEC76				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR2_SEC75				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR2_SEC74				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR2_SEC73				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR2_SEC72				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR2_SEC71				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR2_SEC70				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR2_SEC69				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR2_SEC68				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR2_SEC67				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR2_SEC66				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR2_SEC65				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR2_SEC64				(0x1u<<0)

#define	RIFSC_RISC_SECCFGR2_SEC95_B_0X0			(0x0u<<31)
#define	RIFSC_RISC_SECCFGR2_SEC95_B_0X1			(0x1u<<31)
#define	RIFSC_RISC_SECCFGR2_SEC94_B_0X0			(0x0u<<30)
#define	RIFSC_RISC_SECCFGR2_SEC94_B_0X1			(0x1u<<30)
#define	RIFSC_RISC_SECCFGR2_SEC93_B_0X0			(0x0u<<29)
#define	RIFSC_RISC_SECCFGR2_SEC93_B_0X1			(0x1u<<29)
#define	RIFSC_RISC_SECCFGR2_SEC92_B_0X0			(0x0u<<28)
#define	RIFSC_RISC_SECCFGR2_SEC92_B_0X1			(0x1u<<28)
#define	RIFSC_RISC_SECCFGR2_SEC91_B_0X0			(0x0u<<27)
#define	RIFSC_RISC_SECCFGR2_SEC91_B_0X1			(0x1u<<27)
#define	RIFSC_RISC_SECCFGR2_SEC90_B_0X0			(0x0u<<26)
#define	RIFSC_RISC_SECCFGR2_SEC90_B_0X1			(0x1u<<26)
#define	RIFSC_RISC_SECCFGR2_SEC89_B_0X0			(0x0u<<25)
#define	RIFSC_RISC_SECCFGR2_SEC89_B_0X1			(0x1u<<25)
#define	RIFSC_RISC_SECCFGR2_SEC88_B_0X0			(0x0u<<24)
#define	RIFSC_RISC_SECCFGR2_SEC88_B_0X1			(0x1u<<24)
#define	RIFSC_RISC_SECCFGR2_SEC87_B_0X0			(0x0u<<23)
#define	RIFSC_RISC_SECCFGR2_SEC87_B_0X1			(0x1u<<23)
#define	RIFSC_RISC_SECCFGR2_SEC86_B_0X0			(0x0u<<22)
#define	RIFSC_RISC_SECCFGR2_SEC86_B_0X1			(0x1u<<22)
#define	RIFSC_RISC_SECCFGR2_SEC85_B_0X0			(0x0u<<21)
#define	RIFSC_RISC_SECCFGR2_SEC85_B_0X1			(0x1u<<21)
#define	RIFSC_RISC_SECCFGR2_SEC84_B_0X0			(0x0u<<20)
#define	RIFSC_RISC_SECCFGR2_SEC84_B_0X1			(0x1u<<20)
#define	RIFSC_RISC_SECCFGR2_SEC83_B_0X0			(0x0u<<19)
#define	RIFSC_RISC_SECCFGR2_SEC83_B_0X1			(0x1u<<19)
#define	RIFSC_RISC_SECCFGR2_SEC82_B_0X0			(0x0u<<18)
#define	RIFSC_RISC_SECCFGR2_SEC82_B_0X1			(0x1u<<18)
#define	RIFSC_RISC_SECCFGR2_SEC81_B_0X0			(0x0u<<17)
#define	RIFSC_RISC_SECCFGR2_SEC81_B_0X1			(0x1u<<17)
#define	RIFSC_RISC_SECCFGR2_SEC80_B_0X0			(0x0u<<16)
#define	RIFSC_RISC_SECCFGR2_SEC80_B_0X1			(0x1u<<16)
#define	RIFSC_RISC_SECCFGR2_SEC79_B_0X0			(0x0u<<15)
#define	RIFSC_RISC_SECCFGR2_SEC79_B_0X1			(0x1u<<15)
#define	RIFSC_RISC_SECCFGR2_SEC78_B_0X0			(0x0u<<14)
#define	RIFSC_RISC_SECCFGR2_SEC78_B_0X1			(0x1u<<14)
#define	RIFSC_RISC_SECCFGR2_SEC77_B_0X0			(0x0u<<13)
#define	RIFSC_RISC_SECCFGR2_SEC77_B_0X1			(0x1u<<13)
#define	RIFSC_RISC_SECCFGR2_SEC76_B_0X0			(0x0u<<12)
#define	RIFSC_RISC_SECCFGR2_SEC76_B_0X1			(0x1u<<12)
#define	RIFSC_RISC_SECCFGR2_SEC75_B_0X0			(0x0u<<11)
#define	RIFSC_RISC_SECCFGR2_SEC75_B_0X1			(0x1u<<11)
#define	RIFSC_RISC_SECCFGR2_SEC74_B_0X0			(0x0u<<10)
#define	RIFSC_RISC_SECCFGR2_SEC74_B_0X1			(0x1u<<10)
#define	RIFSC_RISC_SECCFGR2_SEC73_B_0X0			(0x0u<<9)
#define	RIFSC_RISC_SECCFGR2_SEC73_B_0X1			(0x1u<<9)
#define	RIFSC_RISC_SECCFGR2_SEC72_B_0X0			(0x0u<<8)
#define	RIFSC_RISC_SECCFGR2_SEC72_B_0X1			(0x1u<<8)
#define	RIFSC_RISC_SECCFGR2_SEC71_B_0X0			(0x0u<<7)
#define	RIFSC_RISC_SECCFGR2_SEC71_B_0X1			(0x1u<<7)
#define	RIFSC_RISC_SECCFGR2_SEC70_B_0X0			(0x0u<<6)
#define	RIFSC_RISC_SECCFGR2_SEC70_B_0X1			(0x1u<<6)
#define	RIFSC_RISC_SECCFGR2_SEC69_B_0X0			(0x0u<<5)
#define	RIFSC_RISC_SECCFGR2_SEC69_B_0X1			(0x1u<<5)
#define	RIFSC_RISC_SECCFGR2_SEC68_B_0X0			(0x0u<<4)
#define	RIFSC_RISC_SECCFGR2_SEC68_B_0X1			(0x1u<<4)
#define	RIFSC_RISC_SECCFGR2_SEC67_B_0X0			(0x0u<<3)
#define	RIFSC_RISC_SECCFGR2_SEC67_B_0X1			(0x1u<<3)
#define	RIFSC_RISC_SECCFGR2_SEC66_B_0X0			(0x0u<<2)
#define	RIFSC_RISC_SECCFGR2_SEC66_B_0X1			(0x1u<<2)
#define	RIFSC_RISC_SECCFGR2_SEC65_B_0X0			(0x0u<<1)
#define	RIFSC_RISC_SECCFGR2_SEC65_B_0X1			(0x1u<<1)
#define	RIFSC_RISC_SECCFGR2_SEC64_B_0X0			(0x0u<<0)
#define	RIFSC_RISC_SECCFGR2_SEC64_B_0X1			(0x1u<<0)

// RISC_SECCFGR3 Configuration

#define	RIFSC_RISC_SECCFGR3_SEC127				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR3_SEC126				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR3_SEC125				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR3_SEC124				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR3_SEC123				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR3_SEC122				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR3_SEC121				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR3_SEC120				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR3_SEC119				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR3_SEC118				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR3_SEC117				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR3_SEC116				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR3_SEC115				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR3_SEC114				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR3_SEC113				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR3_SEC112				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR3_SEC111				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR3_SEC110				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR3_SEC109				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR3_SEC108				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR3_SEC107				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR3_SEC106				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR3_SEC105				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR3_SEC104				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR3_SEC103				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR3_SEC102				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR3_SEC101				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR3_SEC100				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR3_SEC99				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR3_SEC98				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR3_SEC97				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR3_SEC96				(0x1u<<0)

