hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
#define	RIFSC_RISC_SECCFGR3_SEC127_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_SECCFGR3_SEC127_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_SECCFGR3_SEC126_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_SECCFGR3_SEC126_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_SECCFGR3_SEC125_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_SECCFGR3_SEC125_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_SECCFGR3_SEC124_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_SECCFGR3_SEC124_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_SECCFGR3_SEC123_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_SECCFGR3_SEC123_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_SECCFGR3_SEC122_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_SECCFGR3_SEC122_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_SECCFGR3_SEC121_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_SECCFGR3_SEC121_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_SECCFGR3_SEC120_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_SECCFGR3_SEC120_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_SECCFGR3_SEC119_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_SECCFGR3_SEC119_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_SECCFGR3_SEC118_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_SECCFGR3_SEC118_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_SECCFGR3_SEC117_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_SECCFGR3_SEC117_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_SECCFGR3_SEC116_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_SECCFGR3_SEC116_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_SECCFGR3_SEC115_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_SECCFGR3_SEC115_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_SECCFGR3_SEC114_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_SECCFGR3_SEC114_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_SECCFGR3_SEC113_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_SECCFGR3_SEC113_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_SECCFGR3_SEC112_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_SECCFGR3_SEC112_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_SECCFGR3_SEC111_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_SECCFGR3_SEC111_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_SECCFGR3_SEC110_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_SECCFGR3_SEC110_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_SECCFGR3_SEC109_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_SECCFGR3_SEC109_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_SECCFGR3_SEC108_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_SECCFGR3_SEC108_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_SECCFGR3_SEC107_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_SECCFGR3_SEC107_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_SECCFGR3_SEC106_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_SECCFGR3_SEC106_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_SECCFGR3_SEC105_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_SECCFGR3_SEC105_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_SECCFGR3_SEC104_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_SECCFGR3_SEC104_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_SECCFGR3_SEC103_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_SECCFGR3_SEC103_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_SECCFGR3_SEC102_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_SECCFGR3_SEC102_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_SECCFGR3_SEC101_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_SECCFGR3_SEC101_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_SECCFGR3_SEC100_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_SECCFGR3_SEC100_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_SECCFGR3_SEC99_B_0X0			(0x0u<<3)
#define	RIFSC_RISC_SECCFGR3_SEC99_B_0X1			(0x1u<<3)
#define	RIFSC_RISC_SECCFGR3_SEC98_B_0X0			(0x0u<<2)
#define	RIFSC_RISC_SECCFGR3_SEC98_B_0X1			(0x1u<<2)
#define	RIFSC_RISC_SECCFGR3_SEC97_B_0X0			(0x0u<<1)
#define	RIFSC_RISC_SECCFGR3_SEC97_B_0X1			(0x1u<<1)
#define	RIFSC_RISC_SECCFGR3_SEC96_B_0X0			(0x0u<<0)
#define	RIFSC_RISC_SECCFGR3_SEC96_B_0X1			(0x1u<<0)

// RISC_SECCFGR4 Configuration

#define	RIFSC_RISC_SECCFGR4_SEC159				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR4_SEC158				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR4_SEC157				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR4_SEC156				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR4_SEC155				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR4_SEC154				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR4_SEC153				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR4_SEC152				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR4_SEC151				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR4_SEC150				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR4_SEC149				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR4_SEC148				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR4_SEC147				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR4_SEC146				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR4_SEC145				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR4_SEC144				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR4_SEC143				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR4_SEC142				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR4_SEC141				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR4_SEC140				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR4_SEC139				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR4_SEC138				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR4_SEC137				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR4_SEC136				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR4_SEC135				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR4_SEC134				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR4_SEC133				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR4_SEC132				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR4_SEC131				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR4_SEC130				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR4_SEC129				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR4_SEC128				(0x1u<<0)

#define	RIFSC_RISC_SECCFGR4_SEC159_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_SECCFGR4_SEC159_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_SECCFGR4_SEC158_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_SECCFGR4_SEC158_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_SECCFGR4_SEC157_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_SECCFGR4_SEC157_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_SECCFGR4_SEC156_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_SECCFGR4_SEC156_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_SECCFGR4_SEC155_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_SECCFGR4_SEC155_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_SECCFGR4_SEC154_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_SECCFGR4_SEC154_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_SECCFGR4_SEC153_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_SECCFGR4_SEC153_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_SECCFGR4_SEC152_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_SECCFGR4_SEC152_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_SECCFGR4_SEC151_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_SECCFGR4_SEC151_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_SECCFGR4_SEC150_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_SECCFGR4_SEC150_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_SECCFGR4_SEC149_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_SECCFGR4_SEC149_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_SECCFGR4_SEC148_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_SECCFGR4_SEC148_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_SECCFGR4_SEC147_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_SECCFGR4_SEC147_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_SECCFGR4_SEC146_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_SECCFGR4_SEC146_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_SECCFGR4_SEC145_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_SECCFGR4_SEC145_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_SECCFGR4_SEC144_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_SECCFGR4_SEC144_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_SECCFGR4_SEC143_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_SECCFGR4_SEC143_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_SECCFGR4_SEC142_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_SECCFGR4_SEC142_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_SECCFGR4_SEC141_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_SECCFGR4_SEC141_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_SECCFGR4_SEC140_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_SECCFGR4_SEC140_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_SECCFGR4_SEC139_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_SECCFGR4_SEC139_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_SECCFGR4_SEC138_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_SECCFGR4_SEC138_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_SECCFGR4_SEC137_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_SECCFGR4_SEC137_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_SECCFGR4_SEC136_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_SECCFGR4_SEC136_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_SECCFGR4_SEC135_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_SECCFGR4_SEC135_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_SECCFGR4_SEC134_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_SECCFGR4_SEC134_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_SECCFGR4_SEC133_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_SECCFGR4_SEC133_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_SECCFGR4_SEC132_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_SECCFGR4_SEC132_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_SECCFGR4_SEC131_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_SECCFGR4_SEC131_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_SECCFGR4_SEC130_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_SECCFGR4_SEC130_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_SECCFGR4_SEC129_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_SECCFGR4_SEC129_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_SECCFGR4_SEC128_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_SECCFGR4_SEC128_B_0X1		(0x1u<<0)

// RISC_SECCFGR5 Configuration

#define	RIFSC_RISC_SECCFGR5_SEC191				(0x1u<<31)
#define	RIFSC_RISC_SECCFGR5_SEC190				(0x1u<<30)
#define	RIFSC_RISC_SECCFGR5_SEC189				(0x1u<<29)
#define	RIFSC_RISC_SECCFGR5_SEC188				(0x1u<<28)
#define	RIFSC_RISC_SECCFGR5_SEC187				(0x1u<<27)
#define	RIFSC_RISC_SECCFGR5_SEC186				(0x1u<<26)
#define	RIFSC_RISC_SECCFGR5_SEC185				(0x1u<<25)
#define	RIFSC_RISC_SECCFGR5_SEC184				(0x1u<<24)
#define	RIFSC_RISC_SECCFGR5_SEC183				(0x1u<<23)
#define	RIFSC_RISC_SECCFGR5_SEC182				(0x1u<<22)
#define	RIFSC_RISC_SECCFGR5_SEC181				(0x1u<<21)
#define	RIFSC_RISC_SECCFGR5_SEC180				(0x1u<<20)
#define	RIFSC_RISC_SECCFGR5_SEC179				(0x1u<<19)
#define	RIFSC_RISC_SECCFGR5_SEC178				(0x1u<<18)
#define	RIFSC_RISC_SECCFGR5_SEC177				(0x1u<<17)
#define	RIFSC_RISC_SECCFGR5_SEC176				(0x1u<<16)
#define	RIFSC_RISC_SECCFGR5_SEC175				(0x1u<<15)
#define	RIFSC_RISC_SECCFGR5_SEC174				(0x1u<<14)
#define	RIFSC_RISC_SECCFGR5_SEC173				(0x1u<<13)
#define	RIFSC_RISC_SECCFGR5_SEC172				(0x1u<<12)
#define	RIFSC_RISC_SECCFGR5_SEC171				(0x1u<<11)
#define	RIFSC_RISC_SECCFGR5_SEC170				(0x1u<<10)
#define	RIFSC_RISC_SECCFGR5_SEC169				(0x1u<<9)
#define	RIFSC_RISC_SECCFGR5_SEC168				(0x1u<<8)
#define	RIFSC_RISC_SECCFGR5_SEC167				(0x1u<<7)
#define	RIFSC_RISC_SECCFGR5_SEC166				(0x1u<<6)
#define	RIFSC_RISC_SECCFGR5_SEC165				(0x1u<<5)
#define	RIFSC_RISC_SECCFGR5_SEC164				(0x1u<<4)
#define	RIFSC_RISC_SECCFGR5_SEC163				(0x1u<<3)
#define	RIFSC_RISC_SECCFGR5_SEC162				(0x1u<<2)
#define	RIFSC_RISC_SECCFGR5_SEC161				(0x1u<<1)
#define	RIFSC_RISC_SECCFGR5_SEC160				(0x1u<<0)

#define	RIFSC_RISC_SECCFGR5_SEC191_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_SECCFGR5_SEC191_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_SECCFGR5_SEC190_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_SECCFGR5_SEC190_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_SECCFGR5_SEC189_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_SECCFGR5_SEC189_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_SECCFGR5_SEC188_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_SECCFGR5_SEC188_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_SECCFGR5_SEC187_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_SECCFGR5_SEC187_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_SECCFGR5_SEC186_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_SECCFGR5_SEC186_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_SECCFGR5_SEC185_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_SECCFGR5_SEC185_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_SECCFGR5_SEC184_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_SECCFGR5_SEC184_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_SECCFGR5_SEC183_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_SECCFGR5_SEC183_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_SECCFGR5_SEC182_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_SECCFGR5_SEC182_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_SECCFGR5_SEC181_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_SECCFGR5_SEC181_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_SECCFGR5_SEC180_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_SECCFGR5_SEC180_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_SECCFGR5_SEC179_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_SECCFGR5_SEC179_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_SECCFGR5_SEC178_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_SECCFGR5_SEC178_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_SECCFGR5_SEC177_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_SECCFGR5_SEC177_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_SECCFGR5_SEC176_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_SECCFGR5_SEC176_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_SECCFGR5_SEC175_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_SECCFGR5_SEC175_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_SECCFGR5_SEC174_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_SECCFGR5_SEC174_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_SECCFGR5_SEC173_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_SECCFGR5_SEC173_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_SECCFGR5_SEC172_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_SECCFGR5_SEC172_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_SECCFGR5_SEC171_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_SECCFGR5_SEC171_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_SECCFGR5_SEC170_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_SECCFGR5_SEC170_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_SECCFGR5_SEC169_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_SECCFGR5_SEC169_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_SECCFGR5_SEC168_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_SECCFGR5_SEC168_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_SECCFGR5_SEC167_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_SECCFGR5_SEC167_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_SECCFGR5_SEC166_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_SECCFGR5_SEC166_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_SECCFGR5_SEC165_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_SECCFGR5_SEC165_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_SECCFGR5_SEC164_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_SECCFGR5_SEC164_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_SECCFGR5_SEC163_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_SECCFGR5_SEC163_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_SECCFGR5_SEC162_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_SECCFGR5_SEC162_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_SECCFGR5_SEC161_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_SECCFGR5_SEC161_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_SECCFGR5_SEC160_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_SECCFGR5_SEC160_B_0X1		(0x1u<<0)

