hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
// RISC_PRIVCFGR0 Configuration

#define	RIFSC_RISC_PRIVCFGR0_PRIV31				(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR0_PRIV30				(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR0_PRIV29				(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR0_PRIV28				(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR0_PRIV27				(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR0_PRIV26				(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR0_PRIV25				(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR0_PRIV24				(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR0_PRIV23				(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR0_PRIV22				(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR0_PRIV21				(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR0_PRIV20				(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR0_PRIV19				(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR0_PRIV18				(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR0_PRIV17				(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR0_PRIV16				(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR0_PRIV15				(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR0_PRIV14				(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR0_PRIV13				(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR0_PRIV12				(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR0_PRIV11				(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR0_PRIV10				(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR0_PRIV9				(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR0_PRIV8				(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR0_PRIV7				(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR0_PRIV6				(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR0_PRIV5				(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR0_PRIV4				(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR0_PRIV3				(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR0_PRIV2				(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR0_PRIV1				(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR0_PRIV0				(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR0_PRIV31_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR0_PRIV31_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR0_PRIV30_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR0_PRIV30_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR0_PRIV29_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR0_PRIV29_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR0_PRIV28_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR0_PRIV28_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR0_PRIV27_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR0_PRIV27_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR0_PRIV26_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR0_PRIV26_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR0_PRIV25_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR0_PRIV25_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR0_PRIV24_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR0_PRIV24_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR0_PRIV23_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR0_PRIV23_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR0_PRIV22_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR0_PRIV22_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR0_PRIV21_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR0_PRIV21_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR0_PRIV20_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR0_PRIV20_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR0_PRIV19_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR0_PRIV19_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR0_PRIV18_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR0_PRIV18_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR0_PRIV17_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR0_PRIV17_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR0_PRIV16_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR0_PRIV16_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR0_PRIV15_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR0_PRIV15_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR0_PRIV14_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR0_PRIV14_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR0_PRIV13_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR0_PRIV13_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR0_PRIV12_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR0_PRIV12_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR0_PRIV11_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR0_PRIV11_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR0_PRIV10_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR0_PRIV10_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR0_PRIV9_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR0_PRIV9_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR0_PRIV8_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR0_PRIV8_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR0_PRIV7_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR0_PRIV7_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR0_PRIV6_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR0_PRIV6_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR0_PRIV5_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR0_PRIV5_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR0_PRIV4_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR0_PRIV4_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR0_PRIV3_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR0_PRIV3_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR0_PRIV2_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR0_PRIV2_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR0_PRIV1_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR0_PRIV1_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR0_PRIV0_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR0_PRIV0_B_0X1		(0x1u<<0)

// RISC_PRIVCFGR1 Configuration

#define	RIFSC_RISC_PRIVCFGR1_PRIV63				(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR1_PRIV62				(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR1_PRIV61				(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR1_PRIV60				(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR1_PRIV59				(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR1_PRIV58				(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR1_PRIV57				(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR1_PRIV56				(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR1_PRIV55				(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR1_PRIV54				(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR1_PRIV53				(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR1_PRIV52				(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR1_PRIV51				(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR1_PRIV50				(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR1_PRIV49				(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR1_PRIV48				(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR1_PRIV47				(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR1_PRIV46				(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR1_PRIV45				(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR1_PRIV44				(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR1_PRIV43				(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR1_PRIV42				(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR1_PRIV41				(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR1_PRIV40				(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR1_PRIV39				(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR1_PRIV38				(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR1_PRIV37				(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR1_PRIV36				(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR1_PRIV35				(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR1_PRIV34				(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR1_PRIV33				(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR1_PRIV32				(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR1_PRIV63_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR1_PRIV63_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR1_PRIV62_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR1_PRIV62_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR1_PRIV61_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR1_PRIV61_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR1_PRIV60_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR1_PRIV60_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR1_PRIV59_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR1_PRIV59_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR1_PRIV58_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR1_PRIV58_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR1_PRIV57_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR1_PRIV57_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR1_PRIV56_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR1_PRIV56_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR1_PRIV55_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR1_PRIV55_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR1_PRIV54_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR1_PRIV54_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR1_PRIV53_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR1_PRIV53_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR1_PRIV52_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR1_PRIV52_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR1_PRIV51_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR1_PRIV51_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR1_PRIV50_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR1_PRIV50_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR1_PRIV49_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR1_PRIV49_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR1_PRIV48_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR1_PRIV48_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR1_PRIV47_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR1_PRIV47_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR1_PRIV46_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR1_PRIV46_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR1_PRIV45_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR1_PRIV45_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR1_PRIV44_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR1_PRIV44_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR1_PRIV43_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR1_PRIV43_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR1_PRIV42_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR1_PRIV42_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR1_PRIV41_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR1_PRIV41_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR1_PRIV40_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR1_PRIV40_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR1_PRIV39_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR1_PRIV39_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR1_PRIV38_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR1_PRIV38_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR1_PRIV37_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR1_PRIV37_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR1_PRIV36_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR1_PRIV36_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR1_PRIV35_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR1_PRIV35_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR1_PRIV34_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR1_PRIV34_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR1_PRIV33_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR1_PRIV33_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR1_PRIV32_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR1_PRIV32_B_0X1		(0x1u<<0)

// RISC_PRIVCFGR2 Configuration

#define	RIFSC_RISC_PRIVCFGR2_PRIV95				(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR2_PRIV94				(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR2_PRIV93				(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR2_PRIV92				(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR2_PRIV91				(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR2_PRIV90				(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR2_PRIV89				(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR2_PRIV88				(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR2_PRIV87				(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR2_PRIV86				(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR2_PRIV85				(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR2_PRIV84				(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR2_PRIV83				(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR2_PRIV82				(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR2_PRIV81				(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR2_PRIV80				(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR2_PRIV79				(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR2_PRIV78				(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR2_PRIV77				(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR2_PRIV76				(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR2_PRIV75				(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR2_PRIV74				(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR2_PRIV73				(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR2_PRIV72				(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR2_PRIV71				(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR2_PRIV70				(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR2_PRIV69				(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR2_PRIV68				(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR2_PRIV67				(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR2_PRIV66				(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR2_PRIV65				(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR2_PRIV64				(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR2_PRIV95_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR2_PRIV95_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR2_PRIV94_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR2_PRIV94_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR2_PRIV93_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR2_PRIV93_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR2_PRIV92_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR2_PRIV92_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR2_PRIV91_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR2_PRIV91_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR2_PRIV90_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR2_PRIV90_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR2_PRIV89_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR2_PRIV89_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR2_PRIV88_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR2_PRIV88_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR2_PRIV87_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR2_PRIV87_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR2_PRIV86_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR2_PRIV86_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR2_PRIV85_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR2_PRIV85_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR2_PRIV84_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR2_PRIV84_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR2_PRIV83_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR2_PRIV83_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR2_PRIV82_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR2_PRIV82_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR2_PRIV81_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR2_PRIV81_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR2_PRIV80_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR2_PRIV80_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR2_PRIV79_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR2_PRIV79_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR2_PRIV78_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR2_PRIV78_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR2_PRIV77_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR2_PRIV77_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR2_PRIV76_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR2_PRIV76_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR2_PRIV75_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR2_PRIV75_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR2_PRIV74_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR2_PRIV74_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR2_PRIV73_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR2_PRIV73_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR2_PRIV72_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR2_PRIV72_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR2_PRIV71_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR2_PRIV71_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR2_PRIV70_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR2_PRIV70_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR2_PRIV69_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR2_PRIV69_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR2_PRIV68_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR2_PRIV68_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR2_PRIV67_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR2_PRIV67_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR2_PRIV66_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR2_PRIV66_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR2_PRIV65_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR2_PRIV65_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR2_PRIV64_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR2_PRIV64_B_0X1		(0x1u<<0)

// RISC_PRIVCFGR3 Configuration

#define	RIFSC_RISC_PRIVCFGR3_PRIV127			(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR3_PRIV126			(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR3_PRIV125			(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR3_PRIV124			(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR3_PRIV123			(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR3_PRIV122			(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR3_PRIV121			(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR3_PRIV120			(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR3_PRIV119			(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR3_PRIV118			(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR3_PRIV117			(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR3_PRIV116			(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR3_PRIV115			(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR3_PRIV114			(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR3_PRIV113			(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR3_PRIV112			(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR3_PRIV111			(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR3_PRIV110			(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR3_PRIV109			(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR3_PRIV108			(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR3_PRIV107			(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR3_PRIV106			(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR3_PRIV105			(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR3_PRIV104			(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR3_PRIV103			(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR3_PRIV102			(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR3_PRIV101			(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR3_PRIV100			(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR3_PRIV99				(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR3_PRIV98				(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR3_PRIV97				(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR3_PRIV96				(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR3_PRIV127_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR3_PRIV127_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR3_PRIV126_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR3_PRIV126_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR3_PRIV125_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR3_PRIV125_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR3_PRIV124_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR3_PRIV124_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR3_PRIV123_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR3_PRIV123_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR3_PRIV122_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR3_PRIV122_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR3_PRIV121_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR3_PRIV121_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR3_PRIV120_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR3_PRIV120_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR3_PRIV119_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR3_PRIV119_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR3_PRIV118_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR3_PRIV118_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR3_PRIV117_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR3_PRIV117_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR3_PRIV116_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR3_PRIV116_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR3_PRIV115_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR3_PRIV115_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR3_PRIV114_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR3_PRIV114_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR3_PRIV113_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR3_PRIV113_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR3_PRIV112_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR3_PRIV112_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR3_PRIV111_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR3_PRIV111_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR3_PRIV110_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR3_PRIV110_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR3_PRIV109_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR3_PRIV109_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR3_PRIV108_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR3_PRIV108_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR3_PRIV107_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR3_PRIV107_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR3_PRIV106_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR3_PRIV106_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR3_PRIV105_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR3_PRIV105_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR3_PRIV104_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR3_PRIV104_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR3_PRIV103_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR3_PRIV103_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR3_PRIV102_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR3_PRIV102_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR3_PRIV101_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR3_PRIV101_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR3_PRIV100_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR3_PRIV100_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR3_PRIV99_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR3_PRIV99_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR3_PRIV98_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR3_PRIV98_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR3_PRIV97_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR3_PRIV97_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR3_PRIV96_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR3_PRIV96_B_0X1		(0x1u<<0)

// RISC_PRIVCFGR4 Configuration

