hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
#define	RIFSC_RISC_PRIVCFGR4_PRIV159			(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR4_PRIV158			(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR4_PRIV157			(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR4_PRIV156			(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR4_PRIV155			(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR4_PRIV154			(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR4_PRIV153			(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR4_PRIV152			(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR4_PRIV151			(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR4_PRIV150			(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR4_PRIV149			(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR4_PRIV148			(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR4_PRIV147			(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR4_PRIV146			(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR4_PRIV145			(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR4_PRIV144			(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR4_PRIV143			(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR4_PRIV142			(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR4_PRIV141			(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR4_PRIV140			(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR4_PRIV139			(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR4_PRIV138			(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR4_PRIV137			(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR4_PRIV136			(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR4_PRIV135			(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR4_PRIV134			(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR4_PRIV133			(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR4_PRIV132			(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR4_PRIV131			(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR4_PRIV130			(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR4_PRIV129			(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR4_PRIV128			(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR4_PRIV159_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR4_PRIV159_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR4_PRIV158_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR4_PRIV158_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR4_PRIV157_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR4_PRIV157_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR4_PRIV156_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR4_PRIV156_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR4_PRIV155_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR4_PRIV155_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR4_PRIV154_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR4_PRIV154_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR4_PRIV153_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR4_PRIV153_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR4_PRIV152_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR4_PRIV152_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR4_PRIV151_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR4_PRIV151_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR4_PRIV150_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR4_PRIV150_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR4_PRIV149_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR4_PRIV149_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR4_PRIV148_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR4_PRIV148_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR4_PRIV147_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR4_PRIV147_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR4_PRIV146_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR4_PRIV146_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR4_PRIV145_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR4_PRIV145_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR4_PRIV144_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR4_PRIV144_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR4_PRIV143_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR4_PRIV143_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR4_PRIV142_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR4_PRIV142_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR4_PRIV141_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR4_PRIV141_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR4_PRIV140_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR4_PRIV140_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR4_PRIV139_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR4_PRIV139_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR4_PRIV138_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR4_PRIV138_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR4_PRIV137_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR4_PRIV137_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR4_PRIV136_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR4_PRIV136_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR4_PRIV135_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR4_PRIV135_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR4_PRIV134_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR4_PRIV134_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR4_PRIV133_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR4_PRIV133_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR4_PRIV132_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR4_PRIV132_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR4_PRIV131_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR4_PRIV131_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR4_PRIV130_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR4_PRIV130_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR4_PRIV129_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR4_PRIV129_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR4_PRIV128_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR4_PRIV128_B_0X1		(0x1u<<0)

// RISC_PRIVCFGR5 Configuration

#define	RIFSC_RISC_PRIVCFGR5_PRIV191			(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR5_PRIV190			(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR5_PRIV189			(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR5_PRIV188			(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR5_PRIV187			(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR5_PRIV186			(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR5_PRIV185			(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR5_PRIV184			(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR5_PRIV183			(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR5_PRIV182			(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR5_PRIV181			(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR5_PRIV180			(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR5_PRIV179			(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR5_PRIV178			(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR5_PRIV177			(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR5_PRIV176			(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR5_PRIV175			(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR5_PRIV174			(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR5_PRIV173			(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR5_PRIV172			(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR5_PRIV171			(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR5_PRIV170			(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR5_PRIV169			(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR5_PRIV168			(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR5_PRIV167			(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR5_PRIV166			(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR5_PRIV165			(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR5_PRIV164			(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR5_PRIV163			(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR5_PRIV162			(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR5_PRIV161			(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR5_PRIV160			(0x1u<<0)

#define	RIFSC_RISC_PRIVCFGR5_PRIV191_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_PRIVCFGR5_PRIV191_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_PRIVCFGR5_PRIV190_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_PRIVCFGR5_PRIV190_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_PRIVCFGR5_PRIV189_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_PRIVCFGR5_PRIV189_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_PRIVCFGR5_PRIV188_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_PRIVCFGR5_PRIV188_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_PRIVCFGR5_PRIV187_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_PRIVCFGR5_PRIV187_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_PRIVCFGR5_PRIV186_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_PRIVCFGR5_PRIV186_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_PRIVCFGR5_PRIV185_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_PRIVCFGR5_PRIV185_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_PRIVCFGR5_PRIV184_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_PRIVCFGR5_PRIV184_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_PRIVCFGR5_PRIV183_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_PRIVCFGR5_PRIV183_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_PRIVCFGR5_PRIV182_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_PRIVCFGR5_PRIV182_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_PRIVCFGR5_PRIV181_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_PRIVCFGR5_PRIV181_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_PRIVCFGR5_PRIV180_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_PRIVCFGR5_PRIV180_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_PRIVCFGR5_PRIV179_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_PRIVCFGR5_PRIV179_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_PRIVCFGR5_PRIV178_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_PRIVCFGR5_PRIV178_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_PRIVCFGR5_PRIV177_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_PRIVCFGR5_PRIV177_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_PRIVCFGR5_PRIV176_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_PRIVCFGR5_PRIV176_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_PRIVCFGR5_PRIV175_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_PRIVCFGR5_PRIV175_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_PRIVCFGR5_PRIV174_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_PRIVCFGR5_PRIV174_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_PRIVCFGR5_PRIV173_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_PRIVCFGR5_PRIV173_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_PRIVCFGR5_PRIV172_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_PRIVCFGR5_PRIV172_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_PRIVCFGR5_PRIV171_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_PRIVCFGR5_PRIV171_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_PRIVCFGR5_PRIV170_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_PRIVCFGR5_PRIV170_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_PRIVCFGR5_PRIV169_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_PRIVCFGR5_PRIV169_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_PRIVCFGR5_PRIV168_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_PRIVCFGR5_PRIV168_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_PRIVCFGR5_PRIV167_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_PRIVCFGR5_PRIV167_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_PRIVCFGR5_PRIV166_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_PRIVCFGR5_PRIV166_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_PRIVCFGR5_PRIV165_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_PRIVCFGR5_PRIV165_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_PRIVCFGR5_PRIV164_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_PRIVCFGR5_PRIV164_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_PRIVCFGR5_PRIV163_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_PRIVCFGR5_PRIV163_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_PRIVCFGR5_PRIV162_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_PRIVCFGR5_PRIV162_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_PRIVCFGR5_PRIV161_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_PRIVCFGR5_PRIV161_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_PRIVCFGR5_PRIV160_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_PRIVCFGR5_PRIV160_B_0X1		(0x1u<<0)

// RISC_RCFGLOCKR0 Configuration

#define	RIFSC_RISC_RCFGLOCKR0_RLOCK31			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK30			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK29			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK28			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK27			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK26			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK25			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK24			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK23			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK22			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK21			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK20			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK19			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK18			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK17			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK16			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK15			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK14			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK13			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK12			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK11			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK10			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK9			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK8			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK7			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK6			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK5			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK4			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK3			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK2			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK1			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK0			(0x1u<<0)

#define	RIFSC_RISC_RCFGLOCKR0_RLOCK31_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK31_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK30_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK30_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK29_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK29_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK28_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK28_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK27_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK27_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK26_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK26_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK25_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK25_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK24_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK24_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK23_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK23_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK22_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK22_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK21_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK21_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK20_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK20_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK19_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK19_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK18_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK18_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK17_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK17_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK16_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK16_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK15_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK15_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK14_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK14_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK13_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK13_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK12_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK12_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK11_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK11_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK10_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK10_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK9_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK9_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK8_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK8_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK7_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK7_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK6_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK6_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK5_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK5_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK4_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK4_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK3_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK3_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK2_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK2_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK1_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK1_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK0_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR0_RLOCK0_B_0X1		(0x1u<<0)

// RISC_RCFGLOCKR1 Configuration

#define	RIFSC_RISC_RCFGLOCKR1_RLOCK63			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK62			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK61			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK60			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK59			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK58			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK57			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK56			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK55			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK54			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK53			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK52			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK51			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK50			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK49			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK48			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK47			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK46			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK45			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK44			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK43			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK42			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK41			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK40			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK39			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK38			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK37			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK36			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK35			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK34			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK33			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK32			(0x1u<<0)

#define	RIFSC_RISC_RCFGLOCKR1_RLOCK63_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK63_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK62_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK62_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK61_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK61_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK60_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK60_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK59_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK59_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK58_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK58_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK57_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK57_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK56_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK56_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK55_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK55_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK54_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK54_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK53_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK53_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK52_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK52_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK51_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK51_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK50_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK50_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK49_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK49_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK48_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK48_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK47_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK47_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK46_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK46_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK45_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK45_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK44_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK44_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK43_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK43_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK42_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK42_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK41_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK41_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK40_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK40_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK39_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK39_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK38_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK38_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK37_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK37_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK36_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK36_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK35_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK35_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK34_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK34_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK33_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK33_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK32_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR1_RLOCK32_B_0X1		(0x1u<<0)

// RISC_RCFGLOCKR2 Configuration

#define	RIFSC_RISC_RCFGLOCKR2_RLOCK95			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK94			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK93			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK92			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK91			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK90			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK89			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK88			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK87			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK86			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK85			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK84			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK83			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK82			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK81			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK80			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK79			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK78			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK77			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK76			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK75			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK74			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK73			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK72			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK71			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK70			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK69			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK68			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK67			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK66			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK65			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK64			(0x1u<<0)

