hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK95_B_0X0		(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK95_B_0X1		(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK94_B_0X0		(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK94_B_0X1		(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK93_B_0X0		(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK93_B_0X1		(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK92_B_0X0		(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK92_B_0X1		(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK91_B_0X0		(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK91_B_0X1		(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK90_B_0X0		(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK90_B_0X1		(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK89_B_0X0		(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK89_B_0X1		(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK88_B_0X0		(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK88_B_0X1		(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK87_B_0X0		(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK87_B_0X1		(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK86_B_0X0		(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK86_B_0X1		(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK85_B_0X0		(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK85_B_0X1		(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK84_B_0X0		(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK84_B_0X1		(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK83_B_0X0		(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK83_B_0X1		(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK82_B_0X0		(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK82_B_0X1		(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK81_B_0X0		(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK81_B_0X1		(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK80_B_0X0		(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK80_B_0X1		(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK79_B_0X0		(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK79_B_0X1		(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK78_B_0X0		(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK78_B_0X1		(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK77_B_0X0		(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK77_B_0X1		(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK76_B_0X0		(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK76_B_0X1		(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK75_B_0X0		(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK75_B_0X1		(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK74_B_0X0		(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK74_B_0X1		(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK73_B_0X0		(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK73_B_0X1		(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK72_B_0X0		(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK72_B_0X1		(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK71_B_0X0		(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK71_B_0X1		(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK70_B_0X0		(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK70_B_0X1		(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK69_B_0X0		(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK69_B_0X1		(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK68_B_0X0		(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK68_B_0X1		(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK67_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK67_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK66_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK66_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK65_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK65_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK64_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR2_RLOCK64_B_0X1		(0x1u<<0)

// RISC_RCFGLOCKR3 Configuration

#define	RIFSC_RISC_RCFGLOCKR3_RLOCK127			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK126			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK125			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK124			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK123			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK122			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK121			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK120			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK119			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK118			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK117			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK116			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK115			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK114			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK113			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK112			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK111			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK110			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK109			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK108			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK107			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK106			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK105			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK104			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK103			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK102			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK101			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK100			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK99			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK98			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK97			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK96			(0x1u<<0)

#define	RIFSC_RISC_RCFGLOCKR3_RLOCK127_B_0X0	(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK127_B_0X1	(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK126_B_0X0	(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK126_B_0X1	(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK125_B_0X0	(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK125_B_0X1	(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK124_B_0X0	(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK124_B_0X1	(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK123_B_0X0	(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK123_B_0X1	(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK122_B_0X0	(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK122_B_0X1	(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK121_B_0X0	(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK121_B_0X1	(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK120_B_0X0	(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK120_B_0X1	(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK119_B_0X0	(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK119_B_0X1	(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK118_B_0X0	(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK118_B_0X1	(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK117_B_0X0	(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK117_B_0X1	(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK116_B_0X0	(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK116_B_0X1	(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK115_B_0X0	(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK115_B_0X1	(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK114_B_0X0	(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK114_B_0X1	(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK113_B_0X0	(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK113_B_0X1	(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK112_B_0X0	(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK112_B_0X1	(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK111_B_0X0	(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK111_B_0X1	(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK110_B_0X0	(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK110_B_0X1	(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK109_B_0X0	(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK109_B_0X1	(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK108_B_0X0	(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK108_B_0X1	(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK107_B_0X0	(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK107_B_0X1	(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK106_B_0X0	(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK106_B_0X1	(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK105_B_0X0	(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK105_B_0X1	(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK104_B_0X0	(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK104_B_0X1	(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK103_B_0X0	(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK103_B_0X1	(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK102_B_0X0	(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK102_B_0X1	(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK101_B_0X0	(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK101_B_0X1	(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK100_B_0X0	(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK100_B_0X1	(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK99_B_0X0		(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK99_B_0X1		(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK98_B_0X0		(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK98_B_0X1		(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK97_B_0X0		(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK97_B_0X1		(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK96_B_0X0		(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR3_RLOCK96_B_0X1		(0x1u<<0)

// RISC_RCFGLOCKR4 Configuration

#define	RIFSC_RISC_RCFGLOCKR4_RLOCK159			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK158			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK157			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK156			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK155			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK154			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK153			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK152			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK151			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK150			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK149			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK148			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK147			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK146			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK145			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK144			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK143			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK142			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK141			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK140			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK139			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK138			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK137			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK136			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK135			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK134			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK133			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK132			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK131			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK130			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK129			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK128			(0x1u<<0)

#define	RIFSC_RISC_RCFGLOCKR4_RLOCK159_B_0X0	(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK159_B_0X1	(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK158_B_0X0	(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK158_B_0X1	(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK157_B_0X0	(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK157_B_0X1	(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK156_B_0X0	(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK156_B_0X1	(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK155_B_0X0	(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK155_B_0X1	(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK154_B_0X0	(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK154_B_0X1	(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK153_B_0X0	(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK153_B_0X1	(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK152_B_0X0	(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK152_B_0X1	(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK151_B_0X0	(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK151_B_0X1	(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK150_B_0X0	(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK150_B_0X1	(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK149_B_0X0	(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK149_B_0X1	(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK148_B_0X0	(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK148_B_0X1	(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK147_B_0X0	(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK147_B_0X1	(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK146_B_0X0	(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK146_B_0X1	(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK145_B_0X0	(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK145_B_0X1	(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK144_B_0X0	(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK144_B_0X1	(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK143_B_0X0	(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK143_B_0X1	(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK142_B_0X0	(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK142_B_0X1	(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK141_B_0X0	(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK141_B_0X1	(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK140_B_0X0	(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK140_B_0X1	(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK139_B_0X0	(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK139_B_0X1	(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK138_B_0X0	(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK138_B_0X1	(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK137_B_0X0	(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK137_B_0X1	(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK136_B_0X0	(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK136_B_0X1	(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK135_B_0X0	(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK135_B_0X1	(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK134_B_0X0	(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK134_B_0X1	(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK133_B_0X0	(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK133_B_0X1	(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK132_B_0X0	(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK132_B_0X1	(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK131_B_0X0	(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK131_B_0X1	(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK130_B_0X0	(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK130_B_0X1	(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK129_B_0X0	(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK129_B_0X1	(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK128_B_0X0	(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR4_RLOCK128_B_0X1	(0x1u<<0)

// RISC_RCFGLOCKR5 Configuration

