hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK191			(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK190			(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK189			(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK188			(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK187			(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK186			(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK185			(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK184			(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK183			(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK182			(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK181			(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK180			(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK179			(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK178			(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK177			(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK176			(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK175			(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK174			(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK173			(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK172			(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK171			(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK170			(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK169			(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK168			(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK167			(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK166			(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK165			(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK164			(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK163			(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK162			(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK161			(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK160			(0x1u<<0)

#define	RIFSC_RISC_RCFGLOCKR5_RLOCK191_B_0X0	(0x0u<<31)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK191_B_0X1	(0x1u<<31)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK190_B_0X0	(0x0u<<30)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK190_B_0X1	(0x1u<<30)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK189_B_0X0	(0x0u<<29)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK189_B_0X1	(0x1u<<29)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK188_B_0X0	(0x0u<<28)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK188_B_0X1	(0x1u<<28)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK187_B_0X0	(0x0u<<27)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK187_B_0X1	(0x1u<<27)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK186_B_0X0	(0x0u<<26)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK186_B_0X1	(0x1u<<26)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK185_B_0X0	(0x0u<<25)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK185_B_0X1	(0x1u<<25)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK184_B_0X0	(0x0u<<24)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK184_B_0X1	(0x1u<<24)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK183_B_0X0	(0x0u<<23)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK183_B_0X1	(0x1u<<23)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK182_B_0X0	(0x0u<<22)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK182_B_0X1	(0x1u<<22)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK181_B_0X0	(0x0u<<21)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK181_B_0X1	(0x1u<<21)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK180_B_0X0	(0x0u<<20)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK180_B_0X1	(0x1u<<20)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK179_B_0X0	(0x0u<<19)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK179_B_0X1	(0x1u<<19)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK178_B_0X0	(0x0u<<18)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK178_B_0X1	(0x1u<<18)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK177_B_0X0	(0x0u<<17)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK177_B_0X1	(0x1u<<17)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK176_B_0X0	(0x0u<<16)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK176_B_0X1	(0x1u<<16)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK175_B_0X0	(0x0u<<15)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK175_B_0X1	(0x1u<<15)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK174_B_0X0	(0x0u<<14)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK174_B_0X1	(0x1u<<14)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK173_B_0X0	(0x0u<<13)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK173_B_0X1	(0x1u<<13)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK172_B_0X0	(0x0u<<12)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK172_B_0X1	(0x1u<<12)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK171_B_0X0	(0x0u<<11)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK171_B_0X1	(0x1u<<11)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK170_B_0X0	(0x0u<<10)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK170_B_0X1	(0x1u<<10)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK169_B_0X0	(0x0u<<9)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK169_B_0X1	(0x1u<<9)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK168_B_0X0	(0x0u<<8)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK168_B_0X1	(0x1u<<8)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK167_B_0X0	(0x0u<<7)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK167_B_0X1	(0x1u<<7)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK166_B_0X0	(0x0u<<6)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK166_B_0X1	(0x1u<<6)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK165_B_0X0	(0x0u<<5)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK165_B_0X1	(0x1u<<5)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK164_B_0X0	(0x0u<<4)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK164_B_0X1	(0x1u<<4)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK163_B_0X0	(0x0u<<3)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK163_B_0X1	(0x1u<<3)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK162_B_0X0	(0x0u<<2)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK162_B_0X1	(0x1u<<2)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK161_B_0X0	(0x0u<<1)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK161_B_0X1	(0x1u<<1)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK160_B_0X0	(0x0u<<0)
#define	RIFSC_RISC_RCFGLOCKR5_RLOCK160_B_0X1	(0x1u<<0)

// RIMC_CR Configuration

#define	RIFSC_RIMC_CR_DAPCID					(0x7u<<8)
#define	RIFSC_RIMC_CR_DAPCID_0					(0x1u<<8)
#define	RIFSC_RIMC_CR_GLOCK						(0x1u<<0)

#define	RIFSC_RIMC_CR_GLOCK_B_0X0				(0x0u<<0)
#define	RIFSC_RIMC_CR_GLOCK_B_0X1				(0x1u<<0)

// RIMC_ATTR0 Configuration

#define	RIFSC_RIMC_ATTR0_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR0_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR0_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR0_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR0_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR0_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR0_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR0_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR1 Configuration

#define	RIFSC_RIMC_ATTR1_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR1_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR1_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR1_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR1_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR1_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR1_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR1_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR2 Configuration

#define	RIFSC_RIMC_ATTR2_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR2_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR2_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR2_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR2_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR2_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR2_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR2_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR3 Configuration

#define	RIFSC_RIMC_ATTR3_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR3_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR3_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR3_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR3_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR3_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR3_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR3_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR4 Configuration

#define	RIFSC_RIMC_ATTR4_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR4_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR4_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR4_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR4_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR4_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR4_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR4_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR5 Configuration

#define	RIFSC_RIMC_ATTR5_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR5_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR5_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR5_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR5_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR5_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR5_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR5_MSEC_B_0X1				(0x1u<<8)

