hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
// RIMC_ATTR6 Configuration

#define	RIFSC_RIMC_ATTR6_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR6_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR6_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR6_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR6_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR6_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR6_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR6_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR7 Configuration

#define	RIFSC_RIMC_ATTR7_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR7_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR7_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR7_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR7_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR7_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR7_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR7_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR8 Configuration

#define	RIFSC_RIMC_ATTR8_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR8_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR8_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR8_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR8_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR8_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR8_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR8_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR9 Configuration

#define	RIFSC_RIMC_ATTR9_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR9_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR9_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR9_MCID_0					(0x1u<<4)

#define	RIFSC_RIMC_ATTR9_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR9_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR9_MSEC_B_0X0				(0x0u<<8)
#define	RIFSC_RIMC_ATTR9_MSEC_B_0X1				(0x1u<<8)

// RIMC_ATTR10 Configuration

#define	RIFSC_RIMC_ATTR10_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR10_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR10_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR10_MCID_0				(0x1u<<4)

#define	RIFSC_RIMC_ATTR10_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR10_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR10_MSEC_B_0X0			(0x0u<<8)
#define	RIFSC_RIMC_ATTR10_MSEC_B_0X1			(0x1u<<8)

// RIMC_ATTR11 Configuration

#define	RIFSC_RIMC_ATTR11_MPRIV					(0x1u<<9)
#define	RIFSC_RIMC_ATTR11_MSEC					(0x1u<<8)
#define	RIFSC_RIMC_ATTR11_MCID					(0x7u<<4)
#define	RIFSC_RIMC_ATTR11_MCID_0				(0x1u<<4)

#define	RIFSC_RIMC_ATTR11_MPRIV_B_0X0			(0x0u<<9)
#define	RIFSC_RIMC_ATTR11_MPRIV_B_0X1			(0x1u<<9)
#define	RIFSC_RIMC_ATTR11_MSEC_B_0X0			(0x0u<<8)
#define	RIFSC_RIMC_ATTR11_MSEC_B_0X1			(0x1u<<8)

// PPSR0 Configuration

#define	RIFSC_PPSR0_PPEN31						(0x1u<<31)
#define	RIFSC_PPSR0_PPEN30						(0x1u<<30)
#define	RIFSC_PPSR0_PPEN29						(0x1u<<29)
#define	RIFSC_PPSR0_PPEN28						(0x1u<<28)
#define	RIFSC_PPSR0_PPEN27						(0x1u<<27)
#define	RIFSC_PPSR0_PPEN26						(0x1u<<26)
#define	RIFSC_PPSR0_PPEN25						(0x1u<<25)
#define	RIFSC_PPSR0_PPEN24						(0x1u<<24)
#define	RIFSC_PPSR0_PPEN23						(0x1u<<23)
#define	RIFSC_PPSR0_PPEN22						(0x1u<<22)
#define	RIFSC_PPSR0_PPEN21						(0x1u<<21)
#define	RIFSC_PPSR0_PPEN20						(0x1u<<20)
#define	RIFSC_PPSR0_PPEN19						(0x1u<<19)
#define	RIFSC_PPSR0_PPEN18						(0x1u<<18)
#define	RIFSC_PPSR0_PPEN17						(0x1u<<17)
#define	RIFSC_PPSR0_PPEN16						(0x1u<<16)
#define	RIFSC_PPSR0_PPEN15						(0x1u<<15)
#define	RIFSC_PPSR0_PPEN14						(0x1u<<14)
#define	RIFSC_PPSR0_PPEN13						(0x1u<<13)
#define	RIFSC_PPSR0_PPEN12						(0x1u<<12)
#define	RIFSC_PPSR0_PPEN11						(0x1u<<11)
#define	RIFSC_PPSR0_PPEN10						(0x1u<<10)
#define	RIFSC_PPSR0_PPEN9						(0x1u<<9)
#define	RIFSC_PPSR0_PPEN8						(0x1u<<8)
#define	RIFSC_PPSR0_PPEN7						(0x1u<<7)
#define	RIFSC_PPSR0_PPEN6						(0x1u<<6)
#define	RIFSC_PPSR0_PPEN5						(0x1u<<5)
#define	RIFSC_PPSR0_PPEN4						(0x1u<<4)
#define	RIFSC_PPSR0_PPEN3						(0x1u<<3)
#define	RIFSC_PPSR0_PPEN2						(0x1u<<2)
#define	RIFSC_PPSR0_PPEN1						(0x1u<<1)
#define	RIFSC_PPSR0_PPEN0						(0x1u<<0)

#define	RIFSC_PPSR0_PPEN31_B_0X0				(0x0u<<31)
#define	RIFSC_PPSR0_PPEN31_B_0X1				(0x1u<<31)
#define	RIFSC_PPSR0_PPEN30_B_0X0				(0x0u<<30)
#define	RIFSC_PPSR0_PPEN30_B_0X1				(0x1u<<30)
#define	RIFSC_PPSR0_PPEN29_B_0X0				(0x0u<<29)
#define	RIFSC_PPSR0_PPEN29_B_0X1				(0x1u<<29)
#define	RIFSC_PPSR0_PPEN28_B_0X0				(0x0u<<28)
#define	RIFSC_PPSR0_PPEN28_B_0X1				(0x1u<<28)
#define	RIFSC_PPSR0_PPEN27_B_0X0				(0x0u<<27)
#define	RIFSC_PPSR0_PPEN27_B_0X1				(0x1u<<27)
#define	RIFSC_PPSR0_PPEN26_B_0X0				(0x0u<<26)
#define	RIFSC_PPSR0_PPEN26_B_0X1				(0x1u<<26)
#define	RIFSC_PPSR0_PPEN25_B_0X0				(0x0u<<25)
#define	RIFSC_PPSR0_PPEN25_B_0X1				(0x1u<<25)
#define	RIFSC_PPSR0_PPEN24_B_0X0				(0x0u<<24)
#define	RIFSC_PPSR0_PPEN24_B_0X1				(0x1u<<24)
#define	RIFSC_PPSR0_PPEN23_B_0X0				(0x0u<<23)
#define	RIFSC_PPSR0_PPEN23_B_0X1				(0x1u<<23)
#define	RIFSC_PPSR0_PPEN22_B_0X0				(0x0u<<22)
#define	RIFSC_PPSR0_PPEN22_B_0X1				(0x1u<<22)
#define	RIFSC_PPSR0_PPEN21_B_0X0				(0x0u<<21)
#define	RIFSC_PPSR0_PPEN21_B_0X1				(0x1u<<21)
#define	RIFSC_PPSR0_PPEN20_B_0X0				(0x0u<<20)
#define	RIFSC_PPSR0_PPEN20_B_0X1				(0x1u<<20)
#define	RIFSC_PPSR0_PPEN19_B_0X0				(0x0u<<19)
#define	RIFSC_PPSR0_PPEN19_B_0X1				(0x1u<<19)
#define	RIFSC_PPSR0_PPEN18_B_0X0				(0x0u<<18)
#define	RIFSC_PPSR0_PPEN18_B_0X1				(0x1u<<18)
#define	RIFSC_PPSR0_PPEN17_B_0X0				(0x0u<<17)
#define	RIFSC_PPSR0_PPEN17_B_0X1				(0x1u<<17)
#define	RIFSC_PPSR0_PPEN16_B_0X0				(0x0u<<16)
#define	RIFSC_PPSR0_PPEN16_B_0X1				(0x1u<<16)
#define	RIFSC_PPSR0_PPEN15_B_0X0				(0x0u<<15)
#define	RIFSC_PPSR0_PPEN15_B_0X1				(0x1u<<15)
#define	RIFSC_PPSR0_PPEN14_B_0X0				(0x0u<<14)
#define	RIFSC_PPSR0_PPEN14_B_0X1				(0x1u<<14)
#define	RIFSC_PPSR0_PPEN13_B_0X0				(0x0u<<13)
#define	RIFSC_PPSR0_PPEN13_B_0X1				(0x1u<<13)
#define	RIFSC_PPSR0_PPEN12_B_0X0				(0x0u<<12)
#define	RIFSC_PPSR0_PPEN12_B_0X1				(0x1u<<12)
#define	RIFSC_PPSR0_PPEN11_B_0X0				(0x0u<<11)
#define	RIFSC_PPSR0_PPEN11_B_0X1				(0x1u<<11)
#define	RIFSC_PPSR0_PPEN10_B_0X0				(0x0u<<10)
#define	RIFSC_PPSR0_PPEN10_B_0X1				(0x1u<<10)
#define	RIFSC_PPSR0_PPEN9_B_0X0					(0x0u<<9)
#define	RIFSC_PPSR0_PPEN9_B_0X1					(0x1u<<9)
#define	RIFSC_PPSR0_PPEN8_B_0X0					(0x0u<<8)
#define	RIFSC_PPSR0_PPEN8_B_0X1					(0x1u<<8)
#define	RIFSC_PPSR0_PPEN7_B_0X0					(0x0u<<7)
#define	RIFSC_PPSR0_PPEN7_B_0X1					(0x1u<<7)
#define	RIFSC_PPSR0_PPEN6_B_0X0					(0x0u<<6)
#define	RIFSC_PPSR0_PPEN6_B_0X1					(0x1u<<6)
#define	RIFSC_PPSR0_PPEN5_B_0X0					(0x0u<<5)
#define	RIFSC_PPSR0_PPEN5_B_0X1					(0x1u<<5)
#define	RIFSC_PPSR0_PPEN4_B_0X0					(0x0u<<4)
#define	RIFSC_PPSR0_PPEN4_B_0X1					(0x1u<<4)
#define	RIFSC_PPSR0_PPEN3_B_0X0					(0x0u<<3)
#define	RIFSC_PPSR0_PPEN3_B_0X1					(0x1u<<3)
#define	RIFSC_PPSR0_PPEN2_B_0X0					(0x0u<<2)
#define	RIFSC_PPSR0_PPEN2_B_0X1					(0x1u<<2)
#define	RIFSC_PPSR0_PPEN1_B_0X0					(0x0u<<1)
#define	RIFSC_PPSR0_PPEN1_B_0X1					(0x1u<<1)
#define	RIFSC_PPSR0_PPEN0_B_0X0					(0x0u<<0)
#define	RIFSC_PPSR0_PPEN0_B_0X1					(0x1u<<0)

// PPSR1 Configuration

#define	RIFSC_PPSR1_PPEN63						(0x1u<<31)
#define	RIFSC_PPSR1_PPEN62						(0x1u<<30)
#define	RIFSC_PPSR1_PPEN61						(0x1u<<29)
#define	RIFSC_PPSR1_PPEN60						(0x1u<<28)
#define	RIFSC_PPSR1_PPEN59						(0x1u<<27)
#define	RIFSC_PPSR1_PPEN58						(0x1u<<26)
#define	RIFSC_PPSR1_PPEN57						(0x1u<<25)
#define	RIFSC_PPSR1_PPEN56						(0x1u<<24)
#define	RIFSC_PPSR1_PPEN55						(0x1u<<23)
#define	RIFSC_PPSR1_PPEN54						(0x1u<<22)
#define	RIFSC_PPSR1_PPEN53						(0x1u<<21)
#define	RIFSC_PPSR1_PPEN52						(0x1u<<20)
#define	RIFSC_PPSR1_PPEN51						(0x1u<<19)
#define	RIFSC_PPSR1_PPEN50						(0x1u<<18)
#define	RIFSC_PPSR1_PPEN49						(0x1u<<17)
#define	RIFSC_PPSR1_PPEN48						(0x1u<<16)
#define	RIFSC_PPSR1_PPEN47						(0x1u<<15)
#define	RIFSC_PPSR1_PPEN46						(0x1u<<14)
#define	RIFSC_PPSR1_PPEN45						(0x1u<<13)
#define	RIFSC_PPSR1_PPEN44						(0x1u<<12)
#define	RIFSC_PPSR1_PPEN43						(0x1u<<11)
#define	RIFSC_PPSR1_PPEN42						(0x1u<<10)
#define	RIFSC_PPSR1_PPEN41						(0x1u<<9)
#define	RIFSC_PPSR1_PPEN40						(0x1u<<8)
#define	RIFSC_PPSR1_PPEN39						(0x1u<<7)
#define	RIFSC_PPSR1_PPEN38						(0x1u<<6)
#define	RIFSC_PPSR1_PPEN37						(0x1u<<5)
#define	RIFSC_PPSR1_PPEN36						(0x1u<<4)
#define	RIFSC_PPSR1_PPEN35						(0x1u<<3)
#define	RIFSC_PPSR1_PPEN34						(0x1u<<2)
#define	RIFSC_PPSR1_PPEN33						(0x1u<<1)
#define	RIFSC_PPSR1_PPEN32						(0x1u<<0)

#define	RIFSC_PPSR1_PPEN63_B_0X0				(0x0u<<31)
#define	RIFSC_PPSR1_PPEN63_B_0X1				(0x1u<<31)
#define	RIFSC_PPSR1_PPEN62_B_0X0				(0x0u<<30)
#define	RIFSC_PPSR1_PPEN62_B_0X1				(0x1u<<30)
#define	RIFSC_PPSR1_PPEN61_B_0X0				(0x0u<<29)
#define	RIFSC_PPSR1_PPEN61_B_0X1				(0x1u<<29)
#define	RIFSC_PPSR1_PPEN60_B_0X0				(0x0u<<28)
#define	RIFSC_PPSR1_PPEN60_B_0X1				(0x1u<<28)
#define	RIFSC_PPSR1_PPEN59_B_0X0				(0x0u<<27)
#define	RIFSC_PPSR1_PPEN59_B_0X1				(0x1u<<27)
#define	RIFSC_PPSR1_PPEN58_B_0X0				(0x0u<<26)
#define	RIFSC_PPSR1_PPEN58_B_0X1				(0x1u<<26)
#define	RIFSC_PPSR1_PPEN57_B_0X0				(0x0u<<25)
#define	RIFSC_PPSR1_PPEN57_B_0X1				(0x1u<<25)
#define	RIFSC_PPSR1_PPEN56_B_0X0				(0x0u<<24)
#define	RIFSC_PPSR1_PPEN56_B_0X1				(0x1u<<24)
#define	RIFSC_PPSR1_PPEN55_B_0X0				(0x0u<<23)
#define	RIFSC_PPSR1_PPEN55_B_0X1				(0x1u<<23)
#define	RIFSC_PPSR1_PPEN54_B_0X0				(0x0u<<22)
#define	RIFSC_PPSR1_PPEN54_B_0X1				(0x1u<<22)
#define	RIFSC_PPSR1_PPEN53_B_0X0				(0x0u<<21)
#define	RIFSC_PPSR1_PPEN53_B_0X1				(0x1u<<21)
#define	RIFSC_PPSR1_PPEN52_B_0X0				(0x0u<<20)
#define	RIFSC_PPSR1_PPEN52_B_0X1				(0x1u<<20)
#define	RIFSC_PPSR1_PPEN51_B_0X0				(0x0u<<19)
#define	RIFSC_PPSR1_PPEN51_B_0X1				(0x1u<<19)
#define	RIFSC_PPSR1_PPEN50_B_0X0				(0x0u<<18)
#define	RIFSC_PPSR1_PPEN50_B_0X1				(0x1u<<18)
#define	RIFSC_PPSR1_PPEN49_B_0X0				(0x0u<<17)
#define	RIFSC_PPSR1_PPEN49_B_0X1				(0x1u<<17)
#define	RIFSC_PPSR1_PPEN48_B_0X0				(0x0u<<16)
#define	RIFSC_PPSR1_PPEN48_B_0X1				(0x1u<<16)
#define	RIFSC_PPSR1_PPEN47_B_0X0				(0x0u<<15)
#define	RIFSC_PPSR1_PPEN47_B_0X1				(0x1u<<15)
#define	RIFSC_PPSR1_PPEN46_B_0X0				(0x0u<<14)
#define	RIFSC_PPSR1_PPEN46_B_0X1				(0x1u<<14)
#define	RIFSC_PPSR1_PPEN45_B_0X0				(0x0u<<13)
#define	RIFSC_PPSR1_PPEN45_B_0X1				(0x1u<<13)
#define	RIFSC_PPSR1_PPEN44_B_0X0				(0x0u<<12)
#define	RIFSC_PPSR1_PPEN44_B_0X1				(0x1u<<12)
#define	RIFSC_PPSR1_PPEN43_B_0X0				(0x0u<<11)
#define	RIFSC_PPSR1_PPEN43_B_0X1				(0x1u<<11)
#define	RIFSC_PPSR1_PPEN42_B_0X0				(0x0u<<10)
#define	RIFSC_PPSR1_PPEN42_B_0X1				(0x1u<<10)
#define	RIFSC_PPSR1_PPEN41_B_0X0				(0x0u<<9)
#define	RIFSC_PPSR1_PPEN41_B_0X1				(0x1u<<9)
#define	RIFSC_PPSR1_PPEN40_B_0X0				(0x0u<<8)
#define	RIFSC_PPSR1_PPEN40_B_0X1				(0x1u<<8)
#define	RIFSC_PPSR1_PPEN39_B_0X0				(0x0u<<7)
#define	RIFSC_PPSR1_PPEN39_B_0X1				(0x1u<<7)
#define	RIFSC_PPSR1_PPEN38_B_0X0				(0x0u<<6)
#define	RIFSC_PPSR1_PPEN38_B_0X1				(0x1u<<6)
#define	RIFSC_PPSR1_PPEN37_B_0X0				(0x0u<<5)
#define	RIFSC_PPSR1_PPEN37_B_0X1				(0x1u<<5)
#define	RIFSC_PPSR1_PPEN36_B_0X0				(0x0u<<4)
#define	RIFSC_PPSR1_PPEN36_B_0X1				(0x1u<<4)
#define	RIFSC_PPSR1_PPEN35_B_0X0				(0x0u<<3)
#define	RIFSC_PPSR1_PPEN35_B_0X1				(0x1u<<3)
#define	RIFSC_PPSR1_PPEN34_B_0X0				(0x0u<<2)
#define	RIFSC_PPSR1_PPEN34_B_0X1				(0x1u<<2)
#define	RIFSC_PPSR1_PPEN33_B_0X0				(0x0u<<1)
#define	RIFSC_PPSR1_PPEN33_B_0X1				(0x1u<<1)
#define	RIFSC_PPSR1_PPEN32_B_0X0				(0x0u<<0)
#define	RIFSC_PPSR1_PPEN32_B_0X1				(0x1u<<0)

// PPSR2 Configuration

#define	RIFSC_PPSR2_PPEN95						(0x1u<<31)
#define	RIFSC_PPSR2_PPEN94						(0x1u<<30)
#define	RIFSC_PPSR2_PPEN93						(0x1u<<29)
#define	RIFSC_PPSR2_PPEN92						(0x1u<<28)
#define	RIFSC_PPSR2_PPEN91						(0x1u<<27)
#define	RIFSC_PPSR2_PPEN90						(0x1u<<26)
#define	RIFSC_PPSR2_PPEN89						(0x1u<<25)
#define	RIFSC_PPSR2_PPEN88						(0x1u<<24)
#define	RIFSC_PPSR2_PPEN87						(0x1u<<23)
#define	RIFSC_PPSR2_PPEN86						(0x1u<<22)
#define	RIFSC_PPSR2_PPEN85						(0x1u<<21)
#define	RIFSC_PPSR2_PPEN84						(0x1u<<20)
#define	RIFSC_PPSR2_PPEN83						(0x1u<<19)
#define	RIFSC_PPSR2_PPEN82						(0x1u<<18)
#define	RIFSC_PPSR2_PPEN81						(0x1u<<17)
#define	RIFSC_PPSR2_PPEN80						(0x1u<<16)
#define	RIFSC_PPSR2_PPEN79						(0x1u<<15)
#define	RIFSC_PPSR2_PPEN78						(0x1u<<14)
#define	RIFSC_PPSR2_PPEN77						(0x1u<<13)
#define	RIFSC_PPSR2_PPEN76						(0x1u<<12)
#define	RIFSC_PPSR2_PPEN75						(0x1u<<11)
#define	RIFSC_PPSR2_PPEN74						(0x1u<<10)
#define	RIFSC_PPSR2_PPEN73						(0x1u<<9)
#define	RIFSC_PPSR2_PPEN72						(0x1u<<8)
#define	RIFSC_PPSR2_PPEN71						(0x1u<<7)
#define	RIFSC_PPSR2_PPEN70						(0x1u<<6)
#define	RIFSC_PPSR2_PPEN69						(0x1u<<5)
#define	RIFSC_PPSR2_PPEN68						(0x1u<<4)
#define	RIFSC_PPSR2_PPEN67						(0x1u<<3)
#define	RIFSC_PPSR2_PPEN66						(0x1u<<2)
#define	RIFSC_PPSR2_PPEN65						(0x1u<<1)
#define	RIFSC_PPSR2_PPEN64						(0x1u<<0)

