hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rifsc.h
// PPSR4 Configuration

#define	RIFSC_PPSR4_PPEN159						(0x1u<<31)
#define	RIFSC_PPSR4_PPEN158						(0x1u<<30)
#define	RIFSC_PPSR4_PPEN157						(0x1u<<29)
#define	RIFSC_PPSR4_PPEN156						(0x1u<<28)
#define	RIFSC_PPSR4_PPEN155						(0x1u<<27)
#define	RIFSC_PPSR4_PPEN154						(0x1u<<26)
#define	RIFSC_PPSR4_PPEN153						(0x1u<<25)
#define	RIFSC_PPSR4_PPEN152						(0x1u<<24)
#define	RIFSC_PPSR4_PPEN151						(0x1u<<23)
#define	RIFSC_PPSR4_PPEN150						(0x1u<<22)
#define	RIFSC_PPSR4_PPEN149						(0x1u<<21)
#define	RIFSC_PPSR4_PPEN148						(0x1u<<20)
#define	RIFSC_PPSR4_PPEN147						(0x1u<<19)
#define	RIFSC_PPSR4_PPEN146						(0x1u<<18)
#define	RIFSC_PPSR4_PPEN145						(0x1u<<17)
#define	RIFSC_PPSR4_PPEN144						(0x1u<<16)
#define	RIFSC_PPSR4_PPEN143						(0x1u<<15)
#define	RIFSC_PPSR4_PPEN142						(0x1u<<14)
#define	RIFSC_PPSR4_PPEN141						(0x1u<<13)
#define	RIFSC_PPSR4_PPEN140						(0x1u<<12)
#define	RIFSC_PPSR4_PPEN139						(0x1u<<11)
#define	RIFSC_PPSR4_PPEN138						(0x1u<<10)
#define	RIFSC_PPSR4_PPEN137						(0x1u<<9)
#define	RIFSC_PPSR4_PPEN136						(0x1u<<8)
#define	RIFSC_PPSR4_PPEN135						(0x1u<<7)
#define	RIFSC_PPSR4_PPEN134						(0x1u<<6)
#define	RIFSC_PPSR4_PPEN133						(0x1u<<5)
#define	RIFSC_PPSR4_PPEN132						(0x1u<<4)
#define	RIFSC_PPSR4_PPEN131						(0x1u<<3)
#define	RIFSC_PPSR4_PPEN130						(0x1u<<2)
#define	RIFSC_PPSR4_PPEN129						(0x1u<<1)
#define	RIFSC_PPSR4_PPEN128						(0x1u<<0)

#define	RIFSC_PPSR4_PPEN159_B_0X0				(0x0u<<31)
#define	RIFSC_PPSR4_PPEN159_B_0X1				(0x1u<<31)
#define	RIFSC_PPSR4_PPEN158_B_0X0				(0x0u<<30)
#define	RIFSC_PPSR4_PPEN158_B_0X1				(0x1u<<30)
#define	RIFSC_PPSR4_PPEN157_B_0X0				(0x0u<<29)
#define	RIFSC_PPSR4_PPEN157_B_0X1				(0x1u<<29)
#define	RIFSC_PPSR4_PPEN156_B_0X0				(0x0u<<28)
#define	RIFSC_PPSR4_PPEN156_B_0X1				(0x1u<<28)
#define	RIFSC_PPSR4_PPEN155_B_0X0				(0x0u<<27)
#define	RIFSC_PPSR4_PPEN155_B_0X1				(0x1u<<27)
#define	RIFSC_PPSR4_PPEN154_B_0X0				(0x0u<<26)
#define	RIFSC_PPSR4_PPEN154_B_0X1				(0x1u<<26)
#define	RIFSC_PPSR4_PPEN153_B_0X0				(0x0u<<25)
#define	RIFSC_PPSR4_PPEN153_B_0X1				(0x1u<<25)
#define	RIFSC_PPSR4_PPEN152_B_0X0				(0x0u<<24)
#define	RIFSC_PPSR4_PPEN152_B_0X1				(0x1u<<24)
#define	RIFSC_PPSR4_PPEN151_B_0X0				(0x0u<<23)
#define	RIFSC_PPSR4_PPEN151_B_0X1				(0x1u<<23)
#define	RIFSC_PPSR4_PPEN150_B_0X0				(0x0u<<22)
#define	RIFSC_PPSR4_PPEN150_B_0X1				(0x1u<<22)
#define	RIFSC_PPSR4_PPEN149_B_0X0				(0x0u<<21)
#define	RIFSC_PPSR4_PPEN149_B_0X1				(0x1u<<21)
#define	RIFSC_PPSR4_PPEN148_B_0X0				(0x0u<<20)
#define	RIFSC_PPSR4_PPEN148_B_0X1				(0x1u<<20)
#define	RIFSC_PPSR4_PPEN147_B_0X0				(0x0u<<19)
#define	RIFSC_PPSR4_PPEN147_B_0X1				(0x1u<<19)
#define	RIFSC_PPSR4_PPEN146_B_0X0				(0x0u<<18)
#define	RIFSC_PPSR4_PPEN146_B_0X1				(0x1u<<18)
#define	RIFSC_PPSR4_PPEN145_B_0X0				(0x0u<<17)
#define	RIFSC_PPSR4_PPEN145_B_0X1				(0x1u<<17)
#define	RIFSC_PPSR4_PPEN144_B_0X0				(0x0u<<16)
#define	RIFSC_PPSR4_PPEN144_B_0X1				(0x1u<<16)
#define	RIFSC_PPSR4_PPEN143_B_0X0				(0x0u<<15)
#define	RIFSC_PPSR4_PPEN143_B_0X1				(0x1u<<15)
#define	RIFSC_PPSR4_PPEN142_B_0X0				(0x0u<<14)
#define	RIFSC_PPSR4_PPEN142_B_0X1				(0x1u<<14)
#define	RIFSC_PPSR4_PPEN141_B_0X0				(0x0u<<13)
#define	RIFSC_PPSR4_PPEN141_B_0X1				(0x1u<<13)
#define	RIFSC_PPSR4_PPEN140_B_0X0				(0x0u<<12)
#define	RIFSC_PPSR4_PPEN140_B_0X1				(0x1u<<12)
#define	RIFSC_PPSR4_PPEN139_B_0X0				(0x0u<<11)
#define	RIFSC_PPSR4_PPEN139_B_0X1				(0x1u<<11)
#define	RIFSC_PPSR4_PPEN138_B_0X0				(0x0u<<10)
#define	RIFSC_PPSR4_PPEN138_B_0X1				(0x1u<<10)
#define	RIFSC_PPSR4_PPEN137_B_0X0				(0x0u<<9)
#define	RIFSC_PPSR4_PPEN137_B_0X1				(0x1u<<9)
#define	RIFSC_PPSR4_PPEN136_B_0X0				(0x0u<<8)
#define	RIFSC_PPSR4_PPEN136_B_0X1				(0x1u<<8)
#define	RIFSC_PPSR4_PPEN135_B_0X0				(0x0u<<7)
#define	RIFSC_PPSR4_PPEN135_B_0X1				(0x1u<<7)
#define	RIFSC_PPSR4_PPEN134_B_0X0				(0x0u<<6)
#define	RIFSC_PPSR4_PPEN134_B_0X1				(0x1u<<6)
#define	RIFSC_PPSR4_PPEN133_B_0X0				(0x0u<<5)
#define	RIFSC_PPSR4_PPEN133_B_0X1				(0x1u<<5)
#define	RIFSC_PPSR4_PPEN132_B_0X0				(0x0u<<4)
#define	RIFSC_PPSR4_PPEN132_B_0X1				(0x1u<<4)
#define	RIFSC_PPSR4_PPEN131_B_0X0				(0x0u<<3)
#define	RIFSC_PPSR4_PPEN131_B_0X1				(0x1u<<3)
#define	RIFSC_PPSR4_PPEN130_B_0X0				(0x0u<<2)
#define	RIFSC_PPSR4_PPEN130_B_0X1				(0x1u<<2)
#define	RIFSC_PPSR4_PPEN129_B_0X0				(0x0u<<1)
#define	RIFSC_PPSR4_PPEN129_B_0X1				(0x1u<<1)
#define	RIFSC_PPSR4_PPEN128_B_0X0				(0x0u<<0)
#define	RIFSC_PPSR4_PPEN128_B_0X1				(0x1u<<0)

// PPSR5 Configuration

#define	RIFSC_PPSR5_PPEN191						(0x1u<<31)
#define	RIFSC_PPSR5_PPEN190						(0x1u<<30)
#define	RIFSC_PPSR5_PPEN189						(0x1u<<29)
#define	RIFSC_PPSR5_PPEN188						(0x1u<<28)
#define	RIFSC_PPSR5_PPEN187						(0x1u<<27)
#define	RIFSC_PPSR5_PPEN186						(0x1u<<26)
#define	RIFSC_PPSR5_PPEN185						(0x1u<<25)
#define	RIFSC_PPSR5_PPEN184						(0x1u<<24)
#define	RIFSC_PPSR5_PPEN183						(0x1u<<23)
#define	RIFSC_PPSR5_PPEN182						(0x1u<<22)
#define	RIFSC_PPSR5_PPEN181						(0x1u<<21)
#define	RIFSC_PPSR5_PPEN180						(0x1u<<20)
#define	RIFSC_PPSR5_PPEN179						(0x1u<<19)
#define	RIFSC_PPSR5_PPEN178						(0x1u<<18)
#define	RIFSC_PPSR5_PPEN177						(0x1u<<17)
#define	RIFSC_PPSR5_PPEN176						(0x1u<<16)
#define	RIFSC_PPSR5_PPEN175						(0x1u<<15)
#define	RIFSC_PPSR5_PPEN174						(0x1u<<14)
#define	RIFSC_PPSR5_PPEN173						(0x1u<<13)
#define	RIFSC_PPSR5_PPEN172						(0x1u<<12)
#define	RIFSC_PPSR5_PPEN171						(0x1u<<11)
#define	RIFSC_PPSR5_PPEN170						(0x1u<<10)
#define	RIFSC_PPSR5_PPEN169						(0x1u<<9)
#define	RIFSC_PPSR5_PPEN168						(0x1u<<8)
#define	RIFSC_PPSR5_PPEN167						(0x1u<<7)
#define	RIFSC_PPSR5_PPEN166						(0x1u<<6)
#define	RIFSC_PPSR5_PPEN165						(0x1u<<5)
#define	RIFSC_PPSR5_PPEN164						(0x1u<<4)
#define	RIFSC_PPSR5_PPEN163						(0x1u<<3)
#define	RIFSC_PPSR5_PPEN162						(0x1u<<2)
#define	RIFSC_PPSR5_PPEN161						(0x1u<<1)
#define	RIFSC_PPSR5_PPEN160						(0x1u<<0)

#define	RIFSC_PPSR5_PPEN191_B_0X0				(0x0u<<31)
#define	RIFSC_PPSR5_PPEN191_B_0X1				(0x1u<<31)
#define	RIFSC_PPSR5_PPEN190_B_0X0				(0x0u<<30)
#define	RIFSC_PPSR5_PPEN190_B_0X1				(0x1u<<30)
#define	RIFSC_PPSR5_PPEN189_B_0X0				(0x0u<<29)
#define	RIFSC_PPSR5_PPEN189_B_0X1				(0x1u<<29)
#define	RIFSC_PPSR5_PPEN188_B_0X0				(0x0u<<28)
#define	RIFSC_PPSR5_PPEN188_B_0X1				(0x1u<<28)
#define	RIFSC_PPSR5_PPEN187_B_0X0				(0x0u<<27)
#define	RIFSC_PPSR5_PPEN187_B_0X1				(0x1u<<27)
#define	RIFSC_PPSR5_PPEN186_B_0X0				(0x0u<<26)
#define	RIFSC_PPSR5_PPEN186_B_0X1				(0x1u<<26)
#define	RIFSC_PPSR5_PPEN185_B_0X0				(0x0u<<25)
#define	RIFSC_PPSR5_PPEN185_B_0X1				(0x1u<<25)
#define	RIFSC_PPSR5_PPEN184_B_0X0				(0x0u<<24)
#define	RIFSC_PPSR5_PPEN184_B_0X1				(0x1u<<24)
#define	RIFSC_PPSR5_PPEN183_B_0X0				(0x0u<<23)
#define	RIFSC_PPSR5_PPEN183_B_0X1				(0x1u<<23)
#define	RIFSC_PPSR5_PPEN182_B_0X0				(0x0u<<22)
#define	RIFSC_PPSR5_PPEN182_B_0X1				(0x1u<<22)
#define	RIFSC_PPSR5_PPEN181_B_0X0				(0x0u<<21)
#define	RIFSC_PPSR5_PPEN181_B_0X1				(0x1u<<21)
#define	RIFSC_PPSR5_PPEN180_B_0X0				(0x0u<<20)
#define	RIFSC_PPSR5_PPEN180_B_0X1				(0x1u<<20)
#define	RIFSC_PPSR5_PPEN179_B_0X0				(0x0u<<19)
#define	RIFSC_PPSR5_PPEN179_B_0X1				(0x1u<<19)
#define	RIFSC_PPSR5_PPEN178_B_0X0				(0x0u<<18)
#define	RIFSC_PPSR5_PPEN178_B_0X1				(0x1u<<18)
#define	RIFSC_PPSR5_PPEN177_B_0X0				(0x0u<<17)
#define	RIFSC_PPSR5_PPEN177_B_0X1				(0x1u<<17)
#define	RIFSC_PPSR5_PPEN176_B_0X0				(0x0u<<16)
#define	RIFSC_PPSR5_PPEN176_B_0X1				(0x1u<<16)
#define	RIFSC_PPSR5_PPEN175_B_0X0				(0x0u<<15)
#define	RIFSC_PPSR5_PPEN175_B_0X1				(0x1u<<15)
#define	RIFSC_PPSR5_PPEN174_B_0X0				(0x0u<<14)
#define	RIFSC_PPSR5_PPEN174_B_0X1				(0x1u<<14)
#define	RIFSC_PPSR5_PPEN173_B_0X0				(0x0u<<13)
#define	RIFSC_PPSR5_PPEN173_B_0X1				(0x1u<<13)
#define	RIFSC_PPSR5_PPEN172_B_0X0				(0x0u<<12)
#define	RIFSC_PPSR5_PPEN172_B_0X1				(0x1u<<12)
#define	RIFSC_PPSR5_PPEN171_B_0X0				(0x0u<<11)
#define	RIFSC_PPSR5_PPEN171_B_0X1				(0x1u<<11)
#define	RIFSC_PPSR5_PPEN170_B_0X0				(0x0u<<10)
#define	RIFSC_PPSR5_PPEN170_B_0X1				(0x1u<<10)
#define	RIFSC_PPSR5_PPEN169_B_0X0				(0x0u<<9)
#define	RIFSC_PPSR5_PPEN169_B_0X1				(0x1u<<9)
#define	RIFSC_PPSR5_PPEN168_B_0X0				(0x0u<<8)
#define	RIFSC_PPSR5_PPEN168_B_0X1				(0x1u<<8)
#define	RIFSC_PPSR5_PPEN167_B_0X0				(0x0u<<7)
#define	RIFSC_PPSR5_PPEN167_B_0X1				(0x1u<<7)
#define	RIFSC_PPSR5_PPEN166_B_0X0				(0x0u<<6)
#define	RIFSC_PPSR5_PPEN166_B_0X1				(0x1u<<6)
#define	RIFSC_PPSR5_PPEN165_B_0X0				(0x0u<<5)
#define	RIFSC_PPSR5_PPEN165_B_0X1				(0x1u<<5)
#define	RIFSC_PPSR5_PPEN164_B_0X0				(0x0u<<4)
#define	RIFSC_PPSR5_PPEN164_B_0X1				(0x1u<<4)
#define	RIFSC_PPSR5_PPEN163_B_0X0				(0x0u<<3)
#define	RIFSC_PPSR5_PPEN163_B_0X1				(0x1u<<3)
#define	RIFSC_PPSR5_PPEN162_B_0X0				(0x0u<<2)
#define	RIFSC_PPSR5_PPEN162_B_0X1				(0x1u<<2)
#define	RIFSC_PPSR5_PPEN161_B_0X0				(0x0u<<1)
#define	RIFSC_PPSR5_PPEN161_B_0X1				(0x1u<<1)
#define	RIFSC_PPSR5_PPEN160_B_0X0				(0x0u<<0)
#define	RIFSC_PPSR5_PPEN160_B_0X1				(0x1u<<0)
